a:3:{s:4:"time";i:1605190622;s:3:"ttl";i:600;s:5:"value";a:7:{s:4:"blog";a:11:{s:4:"name";s:8:"Блог";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:71:"//www.webasyst.com/wa-data/public/updates/img/43/43/icon.png?v=1.4.7.46";s:5:"icons";a:4:{i:96;s:66:"//www.webasyst.com/wa-data/public/updates/img/43/43/icon.96x96.png";i:48;s:66:"//www.webasyst.com/wa-data/public/updates/img/43/43/icon.48x48.png";i:24;s:66:"//www.webasyst.com/wa-data/public/updates/img/43/43/icon.24x24.png";i:16;s:66:"//www.webasyst.com/wa-data/public/updates/img/43/43/icon.16x16.png";}s:10:"commercial";b:0;s:7:"version";s:8:"1.4.7.46";s:12:"download_url";s:54:"http://www.webasyst.com/download/archive/wa-apps/blog/";s:12:"requirements";a:1:{s:13:"app.installer";a:2:{s:7:"version";s:8:">=1.14.3";s:6:"strict";b:1;}}s:9:"changelog";a:5:{i:0;a:3:{s:7:"version";s:8:"1.4.7.46";s:7:"content";s:125:"<ul>
    <li>Исправили отображение списков записей блога на сайте.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 15:11:18";}i:1;a:3:{s:7:"version";s:8:"1.4.6.45";s:7:"content";s:266:"<ul>
   <li>Исправили локализацию сообщения об ошибке в настройках блога.</li>
   <li>Исправили обработку адресов несуществующих страниц на сайте.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:39:29";}i:2;a:3:{s:7:"version";s:8:"1.4.5.42";s:7:"content";s:130:"<ul>
    <li>Формирование заголовка <code>Last-Modified</code> для страниц сайта.</li>
</ul>";s:8:"datetime";s:19:"2020-08-11 14:39:22";}i:3;a:3:{s:7:"version";s:8:"1.4.4.39";s:7:"content";s:180:"<ul>
    <li>Отображение названий блогов в настройке поселения «Опубликованные блоги и адреса».</li>
</ul>";s:8:"datetime";s:19:"2020-07-13 12:39:01";}i:4;a:3:{s:7:"version";s:8:"1.4.3.37";s:7:"content";s:127:"<ul>
    <li>Исправлен режим параллельного редактирования записей.</li>
</ul>";s:8:"datetime";s:19:"2020-06-10 14:23:12";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:9:"installer";a:11:{s:4:"name";s:18:"Инсталлер";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:73:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.png?v=1.14.7.563";s:5:"icons";a:4:{i:96;s:66:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.96x96.png";i:48;s:66:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.48x48.png";i:24;s:66:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.24x24.png";i:16;s:66:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.16x16.png";}s:10:"commercial";b:0;s:7:"version";s:10:"1.14.7.563";s:12:"download_url";a:4:{s:17:"wa-apps/installer";s:59:"http://www.webasyst.com/download/archive/wa-apps/installer/";s:9:"wa-system";s:51:"http://www.webasyst.com/download/archive/wa-system/";s:10:"wa-content";s:52:"http://www.webasyst.com/download/archive/wa-content/";s:12:"wa-installer";s:54:"http://www.webasyst.com/download/archive/wa-installer/";}s:12:"requirements";a:6:{s:3:"php";a:2:{s:6:"strict";b:1;s:7:"version";s:8:">=5.6.25";}s:8:"php.curl";a:2:{s:11:"description";s:43:"Get updates information from update servers";s:6:"strict";b:0;}s:22:"phpini.allow_url_fopen";a:3:{s:11:"description";s:43:"Get updates information from update servers";s:6:"strict";b:0;s:5:"value";i:1;}s:12:"php.mbstring";a:2:{s:6:"strict";b:1;s:5:"value";i:1;}s:29:"phpini.mbstring.func_overload";a:3:{s:11:"description";s:20:"Smarty properly work";s:6:"strict";b:1;s:5:"value";s:2:"<2";}s:94:"rights..|wa-installer|install.php|api.php|wa-log|wa-data/protected|wa-apps|wa-content|wa-cache";a:2:{s:11:"description";s:42:"Check folder rights for install and update";s:6:"strict";b:1;}}s:9:"changelog";a:10:{i:0;a:3:{s:7:"version";s:10:"1.14.7.563";s:7:"content";s:431:"<ul>
   <li>Для разработчиков:
       <ul>
           <li>Иконки Font Awesome для разработки более современных интерфейсов пользователя.
           </li>
           <li>Улучшили работу сборщика файлов локализации при использовании функции <em>_wd()</em>.</li>
       </ul>
   </li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:38:16";}i:1;a:3:{s:7:"version";s:10:"1.14.6.560";s:7:"content";s:62:"<ul>
    <li>Исправление ошибок.</li>
</ul>";s:8:"datetime";s:19:"2020-09-24 16:57:36";}i:2;a:3:{s:7:"version";s:10:"1.14.5.559";s:7:"content";s:2080:"<ul>
   <li><strong>Улучшили функцию входа с помощью Webasyst ID</strong>:
       <ul>
           <li>Добавили в приложении «Настройки» кнопку для отправки всем сотрудникам email-приглашения к подключению Webasyst ID: красивое письмо-уведомление с персональной ссылкой на регистрацию и подробным объяснением того, что такое Webasyst ID.</li>
           <li>Флажок «Запомнить меня» при входе с Webasyst ID: включите его — система запомнит вас и не будет каждый раз просить ввести пароль.</li>
           <li>Новый адаптер авторизации: вход в личный кабинет зарегистрированного клиента с помощью Webasyst ID — по аналогии со входом через социальные сети. Получить ключи для настройки авторизации нужно в Центре заказчика.</li>
        </ul>
    </li>
    <li>Другие исправления и улучшения:
        <ul>
            <li>Формирование адресов ссылок в интерфейсе пользователя.</li>
            <li>Исправлено перенаправление на HTTPS для Sitemap-файла, включённое в настройках сайта.</li>
            <li>Исправлена передача токена API в HTTP-заголовке.</li>
            <li>Срок хранения записей cookie с именами <code>utm</code> и <code>referer</code> увеличен с 30 до 90 дней.</li>
            <li>Выбор механизма обработки изображений (расширения PHP) в приложении «Настройки».</li>
        </ul>
    </li>
</ul>";s:8:"datetime";s:19:"2020-09-24 14:23:00";}i:3;a:3:{s:7:"version";s:10:"1.14.4.556";s:7:"content";s:62:"<ul>
    <li>Исправление ошибок.</li>
</ul>";s:8:"datetime";s:19:"2020-08-12 11:19:17";}i:4;a:3:{s:7:"version";s:10:"1.14.3.555";s:7:"content";s:1805:"<ul>
    <li>Новые возможности:
        <ul>
            <li>Формирование заголовка <code>Last-Modified</code> для страниц сайта.</li>
            <li>Инструмент для восстановления потерянных индексов и значений <code>AUTO_INCREMENT</code> в таблицах базы данных.</li>
            <li>Для разработчиков:</li>
            <ul>
                <li>События <code>email_send.before</code> и <code>email_send.after</code> для обработки отправки email-сообщений.</li>
                <li>События <code>sms_send.before</code> и <code>sms_send.after</code> для обработки отправки SMS-сообщений.</li>
                <li>Возможность отправки токена API в содержимом POST-запроса.</li>
            </ul>
        </ul>
    </li>
    <li>Улучшения и исправления:
        <ul>
            <li>Оптимизирована работа класса <code>waRouting</code>.</li>
            <li>Из консоли браузера удалены ошибки, связанные с кросс-доменной авторизацией.</li>
            <li>Устранена ошибка 404 при открытии страницы, адрес которой совпадает с адресом отключённого правила маршрутизации типа «Перенеправление».</li>
            <li>Устранена ошибка обновления тем дизайна при наличии в них пользовательских файлов.</li>
        </ul>
    </li>
</ul>";s:8:"datetime";s:19:"2020-08-11 14:38:20";}i:5;a:3:{s:7:"version";s:10:"1.14.2.547";s:7:"content";s:476:"<ul>
    <li>Улучшено формирование тегов <em>canonical</em> на страницах сайта.</li>
    <li>Устранена ошибка PHP при редактировании профиля зарегистрированного посетителя сайта.</li>
    <li>Автоматизированная установка фреймворка из git-репозитория с помощью веб-интерфейса.</li>
</ul>";s:8:"datetime";s:19:"2020-07-13 12:37:45";}i:6;a:3:{s:7:"version";s:10:"1.14.0.541";s:7:"content";s:0:"";s:8:"datetime";s:19:"2020-06-25 14:59:06";}i:7;a:3:{s:7:"version";s:10:"1.14.0.540";s:7:"content";s:361:"<ul>
    <li><strong>Вход с помощью Webasyst ID</strong><br>
        Удобная возможность входить в свою панель управления Webasyst и в Центр заказчика с одним общим паролем. У каждого пользователя — свой личный Webasyst ID.</li>
</ul>";s:8:"datetime";s:19:"2020-06-25 14:01:28";}i:8;a:3:{s:7:"version";s:10:"1.13.9.537";s:7:"content";s:2820:"<ul>
    <li>Добавлена временная зона <em>+6.5 (Asia/Yangon)</em>.</li>
    <li>Viber добавлен в список мессенджеров в профиле редактирования контакта.</li>
    <li>Хранение файлов кеша в нескольких директориях (версионность) для более точного использования кешированных данных в программных продуктах.</li>
    <li>Исправлен выход из режима предварительного просмотра тем дизайна в некоторых ситуациях.</li>
    <li>Улучшен интерфейс экспорта настроек дизайна для случаев, когда у дочерней темы нет собственных настроек и она использует только настройки родительской темы.</li>
    <li>Исправлено сохранение правил отправки email-сообщений для доменов 3-го уровня и выше.</li>
    <li>Длина пароля, который может ввести пользователь, ограничена 255 символами.</li>
    <li>Улучшена поддержка PHP 7.4 в панели управления.</li>
    <li>Исправлено сохранение информационных страниц в разных приложениях.</li>
    <li>Исправлено сохранение настроек авторизации для пользователей панели управления.</li>
    <li>Исправлена работа программных продуктов, которые используют значение заголовка <em>HTTP_REFERER</em> в панели управления Webasyst.</li>
    <li>Устранено ошибочное удаление фотографии клиента при редактировании профиля в личном кабинете.</li>
    <li>Улучшена система безопасности.</li>
    <li>Исправлено использование виджета для оценки продукта в интерфейсах разных программных продуктов в случае, если у пользователя нет доступа к приложению «Инсталлер».</li>
    <li>Для разработчиков:
        <ul>
            <li>Исправлен сбор ключей локализации для плагинов приложений с помощью консольной команды <em>wa.php locale</em>.</li>
        </ul>
    </li>
</ul>";s:8:"datetime";s:19:"2020-06-10 14:21:59";}i:9;a:3:{s:7:"version";s:10:"1.13.8.526";s:7:"content";s:1447:"<ul>
    <li>Исправление ошибок:
        <ul>
            <li>Улучшена проверка существующих адресов сайта при сохранении страницы.</li>
            <li>Улучшена поддержка PHP 7.2 и 7.4.</li>
            <li>Регистрация посетителей сайта с использованием одноразового кода при его отправке по email.</li>
            <li>Регистрация посетителей сайта по номеру телефона.</li>
            <li>Вход в панель управления по номеру телефона.</li>
        </ul>
    </li>
    <li>Для разработчиков:
        <ul>
            <li>Поддержка параметра <em>idle</em> в значении, которое передаётся системному контроллеру панели <em>?action=count</em> для определения активности пользователя в панели управления.</li>
            <li>Улучшена проверка параметров конфигурации PHP <em>safe_mode</em> и <em>open_basedir</em> в классе <em>waNet</em>.</li>
            <li>Улучшение консольных команд <em>compress</em> и <em>createSystemplugin</em>.</li>
        </ul>
    </li>
</ul>";s:8:"datetime";s:19:"2020-04-28 12:51:33";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:4:"shop";a:12:{s:4:"name";s:11:"Shop-Script";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:73:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.png?v=8.14.1.39";s:5:"icons";a:4:{i:96;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.96x96.png";i:48;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.48x48.png";i:24;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.24x24.png";i:16;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.16x16.png";}s:10:"commercial";b:1;s:7:"version";s:9:"8.14.1.39";s:12:"download_url";s:54:"http://www.webasyst.com/download/archive/wa-apps/shop/";s:12:"requirements";a:3:{s:13:"app.installer";a:2:{s:7:"version";s:12:">=1.14.7.563";s:6:"strict";b:1;}s:8:"app.site";a:2:{s:7:"version";s:7:">=2.5.0";s:6:"strict";b:1;}s:3:"php";a:2:{s:7:"version";s:5:">=5.6";s:6:"strict";b:1;}}s:9:"changelog";a:8:{i:0;a:3:{s:7:"version";s:9:"8.14.1.39";s:7:"content";s:113:"<ul>
    <li>Исправили ошибку SQL при обновлении до версии 8.14.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 17:24:16";}i:1;a:3:{s:7:"version";s:9:"8.14.0.38";s:7:"content";s:6347:"<ul>
   <li><strong>Предварительная версия нового редактора товара</strong>. В нём пока доступны не все возможности, но уже можно заполнять основные данные товара: название, статус, тип, категории, списки, налог, описание, теги, артикулы, характеристики. С помощью нового редактора пока нельзя добавлять новые товары &mdash; можно только изменять уже созданные.<br> <br> Попробуйте новый редактор товаров и напишите нам, что вам в нём понравилось, а что вы хотели бы улучшить. Мы активно работаем над тем, чтобы сделать удобнее интерфейс пользователя Shop-Script и стараемся учитывать ваши пожелания и замечания.<br> <br> <em>Старый редактор товара остаётся доступным &mdash; новая версия редактора добавлена параллельно со старым для ознакомления.</em></li>
   <li><strong>Ввод, редактирование и удаление купона на скидку при создании или редактировании заказа</strong>.</li>
   <li><strong>Передача кодов маркировки товаров в плагины оплаты, которые поддерживают фискализацию чеков</strong>. Коды маркировки заполняются в заказах в виде товарных кодов &mdash; например, с помощью плагина «Честный ЗНАК».<br><br><em>Для того чтобы вы могли использовать возможность передачи кодов маркировки операторам фискальных данных, её также должны поддерживать плагины оплаты, которые у вас установлены</em>.</li>
   <li>Другие улучшения и исправления:
       <ul>
           <li>Исправили обновление содержимого на информационных страницах &mdash; например, информации о стоимости товаров в корзине, или данных, отображаемых плагинами.</li>
           <li>Реализовали экспорт специальных цен товаров, изменённых плагинами. Например, при экспорте товаров в YML-файл с помощью плагина «Яндекс.Маркет».</li>
           <li>Улучшили выбор витрин в настройках уведомлений о заказах и триггерных рассылок. Теперь можно настроить отправку уведомлений и отдельно для витрин на сайтах-зеркалах.</li>
           <li>Улучшили формирование адресов товаров и категорий, в названиях которых есть специальные символы. Например, вместо косой черты (/) в автоматически сформированный адрес товара или категории будет подставляться дефис.</li>
           <li>При автоматической регистрации покупателей теперь учитывается настройка личного кабинета «<em>Отправлять пользователям уведомление о завершении регистрации</em>». Автоматическая регистрация может срабатывать при использовании 2-го и 3-го варианта настройки «<em>Обновление профилей покупателей и автоматическая регистрация</em>» для оформления заказа в корзине.</li>
           <li>Добавили отображение идентификатора плагина на странице настройки способов доставки и оплаты — в правом верхнем углу.</li>
           <li>Добавили проверку правильности времени, которое вы вводите в столбце «Заказы в обработку» в настройках графика работы магазина.</li>
           <li>Добавили проверку при вводе адреса электронной почты покупателя, чтобы нельзя было добавить в адрес пробел, например, по ошибке.</li>
           <li>Исправили дублирование заказов на вкладке товара «Последние заказы» в интерфейсе администратора магазина.</li>
           <li>Исправили отображение значений характеристик с форматом «Число × число» и «Число × число × число» в списках товаров на витрине магазина.</li>
           <li>Исправили отображение заголовков групп характеристик на витрине после редактирования товаров и создания дубликатов товаров.</li>
           <li>Исправили ссылки навигации по длинному списку акций в разделе «Маркетинг».</li>
           <li>Устранили показ отзывов о товарах, тип которых отключён в настройках витрины.</li>
           <li>Исправили обработку адресов несуществующих страниц витрины.</li>
       </ul>
   </li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:38:55";}i:2;a:3:{s:7:"version";s:9:"8.13.0.37";s:7:"content";s:4474:"<ul>
    <li>Новые возможности:
        <ul>
            <li><strong>Создание личного кабинета покупателя в панели администратора магазина</strong>.</li>
            <li><strong>Сброс и отправка пароля зарегистрированного покупателя на его email-адрес</strong>.</li>
            <li>Редактирование заказов в статусе «Средства заблокированы».</li>
            <li>Для разработчиков:
                <ul>
                    <li>Возможность отключить редактирование заказов в статусе «Средства заблокированы» с помощью плагинов, использующих событие <code>backend_order_partial_edit</code>.</li>
                    <li>Возможность выполнения метода <code>duplicate()</code> класса <code>shopProduct</code> в CLI-контроллерах.</li>
                </ul>
            </li>
        </ul>
    </li>
    <li>Улучшения и исправления:
        <ul>
            <li>Исправлено формирование тега <code>canonical</code> на страницах категорий товаров на витрине магазина.</li>
            <li>Возможность изменить регистр текста при редактировании значений характеристик.</li>
            <li>Устранена потеря эскизов изображений после включения настройки «Использовать исходные имена файлов».</li>
            <li>Исправлена проверка наличия товара на складе при его покупке с услугой и без услуг.</li>
            <li>Исправлено отображение размера скидки, которая автоматически применяется при создании заказа в панели администратора.</li>
            <li>Исправлено сохранение введённой вручную скидки при редактировании заказа.</li>
            <li>Подсказка в истории обработки заказа об автоматическом уменьшении размера скидки, если введённая вручную администратором скидка во время редактирования заказа превышает стоимость заказанных товаров.</li>
            <li>Устранено автоматическое применение скидки при сохранении отредактированного заказа без ведома администратора магазина.</li>
            <li>Исправлено распределение скидок между товарами в заказе.</li>
            <li>Подсказка для администратора магазина при попытке переместить категорию товаров внутрь другой категории, если в результате этого совпадают URL нескольких подкатегорий.</li>
            <li>Исправлен учёт единицы измерения по умолчанию, выбранной в настройках характеристик товаров, при импорте товаров из CSV-файла.</li>
            <li>Исправлено отображение меню раздела «Отчеты» с большим количеством элементов, добавленных плагинами.</li>
            <li>Устранена ошибка PHP «<em>strtotime() expects parameter 1 to be string, array given in shopCheckoutDetailsStep.class.php</em>» при использовании некоторых плагинов доставки.</li>
        </ul>
    </li>
    <li>Тема дизайна «Дефолт 3.0»:
        <ul>
            <li>Фильтрация товаров по значениям характеристик типа «Дата».</li>
        </ul>
    </li>
</ul>";s:8:"datetime";s:19:"2020-08-11 14:38:52";}i:3;a:3:{s:7:"version";s:9:"8.12.0.35";s:7:"content";s:2723:"<ul>
    <li>Новые возможности:
        <ul>
            <li><strong>Настройки поиска в разделе «Покупатели»</strong>:
                <ul>
                    <li>поиск покупателей с любыми заказами или только с неоплаченными заказами и поиск любых контактов вне зависимости от наличия заказов;</li>
                    <li>подсчёт только оплаченных, только неоплаченных или любых заказов для поиска покупателей с заказами.</li>
                </ul>
            </li>
            <li><strong>Новый тип характеристик товаров «Дата»</strong>.</li>
        </ul>
    </li>
    <li>Улучшения и исправления ошибок:
        <ul>
            <li>Отображение стандартных эскизов для товаров без загруженных изображений в панели управления магазина на экранах с высокой плотностью пикселей (Retina).</li>
            <li>Подстановка значений переменных в email-уведомления, которые отправляются для подтверждения регистрации покупателя.</li>
            <li>Сохранение стандартной иконки в свойствах категории покупателей.</li>
            <li>Сохранение настроек статусов и действий с заказами в случае внесения изменений плагинами в файл конфигурации этих настроек.</li>
            <li>Редактирование заказа после удаления плагина способа доставки, который был ранее выбран в свойствах заказа.</li>
            <li>Подсказка для покупателей о выборе желаемой даты доставки курьером во время оформления заказа.</li>
            <li>Просмотр заказов в панели управления магазина при использовании разных настроек валют.</li>
            <li>Адрес ссылки для просмотра товара в списке отзывов в профиле покупателя в панели управления магазина. </li>
        </ul>
    </li>
</ul>";s:8:"datetime";s:19:"2020-07-13 12:38:35";}i:4;a:3:{s:7:"version";s:9:"8.11.1.34";s:7:"content";s:416:"<ul>
    <li>Исправлено сохранение и отображение значений характеристик типа «Переключатель „да/нет”».</li>
    <li>Исправлен просмотр заказов в панели управления интернет-магазина при использовании разных конфигураций валют.</li>
</ul>";s:8:"datetime";s:19:"2020-06-18 11:52:56";}i:5;a:3:{s:7:"version";s:9:"8.11.0.33";s:7:"content";s:6319:"<ul>
    <li>Новые возможности:
        <ul>
            <li><strong>Собственные URL для каждого артикула товара</strong> с параметром вида <em>?sku=xxx</em>. При переходе посетителя по такому адресу автоматически выбирается соответствующий артикул товара.</li>
            <li><strong>Улучшено распределение скидки в заказе</strong> с помощью новой настройки валют «Распределение скидки в заказе»:
                <ul>
                    <li>возможность изменить точность суммы, которая используется для корректировки размера скидки;</li>
                    <li>возможность разделять одну из позиций заказа на две для точного распределения скидки.</li>
                </ul>
            </li>
            <li>Выбор витрин для публикации товаров в настройках типов товаров.</li>
            <li>Системная характеристика «GTIN» для хранения значений кодов маркировки и учёта товаров.</li>
            <li>Выбор единицы измерения по умолчанию в настройках характеристик товаров.</li>
        </ul>
    </li>
    <li>Улучшения и исправления ошибок:
        <ul>
            <li>Сообщение для покупателя о невозможности купить товар, добавленный в корзину, который после этого был помечен как скрытый с сайта.</li>
            <li>Исправлено сохранение валют в настройках способов оплаты.</li>
            <li>Исправлена доступность дополнительных полей адреса плагинов доставки при редактировании заказа.</li>
            <li>Исправлен автоматический выбор страны в профиле покупателя при редактировании заказа.</li>
            <li>Исправлен выбор способа доставки во время редактирования заказа при использовании плагина доставки «Boxberry».</li>
            <li>Улучшено редактирование заказа в интернет-магазинах с большим количеством витрин.</li>
            <li>Исправлен учёт скидок, настроенных в личном кабинете плагина доставки «Яндекс.Доставка» во время оформления заказа.</li>
            <li>Возможность списания и возврата средств при использовании двухстадийной оплаты после изменения статуса заказа с «Средства заблокированы» на любой другой статус.</li>
            <li>Исправлена ошибка при просмотре заказа после удаления использованного в нём плагина оплаты.</li>
            <li>Добавлена поддержка ссылок на страницу проверки статуса заказа на витрине без косой черты в конце адреса ссылки.</li>
            <li>Исправлена сортировка товаров в разделе «Товары → Склад».</li>
            <li>Добавлена единица измерения «мг» для характеристики «Вес».</li>
            <li>Исправлено отображение значений характеристик с форматом «Значение х Значение (х Значение)» в списках товаров на витрине.</li>
            <li>Обновлён код для публикации списков товаров на страницах сайта.</li>
            <li>Исправлен выбор товаров из списков, сформированных плагинами в разделе «Товары».</li>
            <li>Исправлена локализация наклеек для изображений товаров при публикации списков товаров на страницах других приложений.</li>
            <li>Улучшен интерфейс настройки рекомендаций с использованием характеристик товаров с типом значений «Переключатель „да/нет”».</li>
            <li>Улучшена проверка значения настройки «Основной email-адрес» при выполнении действия с заказом «Написать клиенту».</li>
            <li>Улучшен формат указания информации об адресе favicon-файла на странице оформления заказа для разных браузеров и веб-сервисов.</li>
            <li>Тема дизайна «Дефолт 3.0»:
                <ul>
                    <li>Обновление списка характеристик при выборе артикулов на странице товара.</li>
                    <li>Обновление значения атрибута <em>title</em> фотографий при смене артикулов на странице товара. </li>
                    <li>Исправлено отображение информации о доступности товара для покупки.</li>
                </ul>
            </li>
        </ul>
    </li>
</ul>";s:8:"datetime";s:19:"2020-06-10 14:22:20";}i:6;a:3:{s:7:"version";s:9:"8.10.0.32";s:7:"content";s:4451:"<ul>
    <li>Новые возможности:
        <ul>
            <li><strong>Частичное списание заказов при использовании двухстадийной оплаты</strong>. Для использования этой возможности требуется её поддержка в плагинах оплаты.</li>
            <li><strong>Настройка витрины для указания количества товаров при просмотре на каждой странице сайта</strong>.</li>
            <li><strong>Поиск заказов по товарным кодам</strong>. Например, по кодам маркировки «Честный ЗНАК».</li>
            <li>Настройка списков товаров по дате изменения.</li>
            <li>Предупреждение о необходимости проверить возможности плагина для фискализации чеков при выполнении частичного возврата.</li>
        </ul>
    </li>
    <li>Исправление ошибок:
        <ul>
            <li>Автоматический подбор значения цвета при вводе его названия в настройках характеристик.</li>
            <li>Устранена повышенная нагрузка на сервер при повторном создании эскизов изображений товаров.</li>
            <li>Выполнение действия с заказом «Изменить параметры доставки».</li>
            <li>Учёт заказов в акции с использованием купона, добавленного после начала действия акции.</li>
            <li>Ошибка «Unknown currency "Array"» при использовании некоторых плагинов оплаты.</li>
            <li>Редактирование заказа с заполненным обязательным полем для ввода дня рождения.</li>
            <li>Уменьшено количество заказов с корректировкой размера скидки.</li>
            <li>Предупреждение для покупателя о том, что товар в корзине закончился на складе, при использовании пошагового оформления заказа.</li>
            <li>Улучшена поддержка плагинов доставки при выключенной настройке оформления заказа в корзине «Запрашивать индекс вместе с названием населенного пункта».</li>
            <li>Улучшен раздел настроек доставки для оформления заказа в корзине.</li>
            <li>Сохранение порядка сортировки значений характеристик.</li>
            <li>Улучшен раздел настройки характеристик товаров.</li>
            <li>Маркировка обязательного для заполнения поля контакта типа <em>radio</em>, если для него выбрано значение на странице оформления заказа в корзине.</li>
            <li>Устранена лишняя повторная корректировка скидки при сохранении заказа в панели управления магазина.</li>
            <li>Отображение режима работы магазина на витрине.</li>
        </ul>
    </li>
    <li>Тема дизайна «Дефолт»:
        <ul>
            <li>Улучшено сообщение об отсутствующих товарах на текущей странице при использовании постраничной навигации по категории.</li>
            <li>Исправлено значение параметра микроразметки <em>reviewCount</em>, если удалены все отзывы о товаре.</li>
        </ul>
    </li>
</ul>";s:8:"datetime";s:19:"2020-04-28 12:51:53";}i:7;a:3:{s:7:"version";s:8:"8.9.1.31";s:7:"content";s:486:"<ul>
    <li>Исправлено применение бесплатной стоимости доставки при использовании плагинов для расчёта скидок.</li>
</ul>

Для разработчиков
<ul>
    <li>Изменено использование события <code>order_calculate_discount</code> плагинами для расчёта скидок при оформлении заказа в корзине.</li>
</ul>";s:8:"datetime";s:19:"2020-04-02 11:14:00";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;s:7:"plugins";a:3:{s:9:"wholesale";a:11:{s:4:"name";s:33:"Минимальный заказ";s:6:"vendor";i:985310;s:4:"icon";s:75:"//www.webasyst.com/wa-data/public/updates/img/76/376/icon.ru_RU.png?v=3.7.5";s:5:"icons";a:1:{i:200;s:75:"//www.webasyst.com/wa-data/public/updates/img/76/376/icon.200x110.ru_RU.png";}s:10:"commercial";b:1;s:7:"version";s:5:"3.7.5";s:12:"download_url";s:72:"http://www.webasyst.com/download/archive/wa-apps/shop/plugins/wholesale/";s:12:"requirements";a:0:{}s:9:"changelog";a:1:{i:0;a:3:{s:7:"version";s:5:"3.7.5";s:7:"content";s:51:"Незначительные исправления";s:8:"datetime";s:19:"2020-09-19 18:21:49";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:3:"xml";a:11:{s:4:"name";s:36:"Импорт товаров из XML";s:6:"vendor";i:1052040;s:4:"icon";s:76:"//www.webasyst.com/wa-data/public/updates/img/49/3349/icon.ru_RU.png?v=1.7.1";s:5:"icons";a:1:{i:200;s:76:"//www.webasyst.com/wa-data/public/updates/img/49/3349/icon.200x110.ru_RU.png";}s:10:"commercial";b:1;s:7:"version";s:5:"1.7.1";s:12:"download_url";s:66:"http://www.webasyst.com/download/archive/wa-apps/shop/plugins/xml/";s:12:"requirements";a:4:{s:8:"php.curl";a:3:{s:4:"name";s:4:"cURL";s:11:"description";s:10:"*function*";s:6:"strict";b:1;}s:13:"php.xmlreader";a:3:{s:4:"name";s:9:"XMLReader";s:11:"description";s:10:"*function*";s:6:"strict";b:1;}s:13:"php.simplexml";a:3:{s:4:"name";s:9:"SimpleXML";s:11:"description";s:10:"*function*";s:6:"strict";b:1;}s:3:"php";a:2:{s:6:"strict";b:1;s:7:"version";s:5:">=5.4";}}s:9:"changelog";a:7:{i:0;a:3:{s:7:"version";s:5:"1.7.1";s:7:"content";s:67:"<ul>
<li>Критическое исправление</li>
</ul>";s:8:"datetime";s:19:"2020-08-04 12:48:46";}i:1;a:3:{s:7:"version";s:5:"1.7.0";s:7:"content";s:67:"<ul>
<li>Критическое исправление</li>
</ul>";s:8:"datetime";s:19:"2020-07-31 22:44:59";}i:2;a:3:{s:7:"version";s:5:"1.6.9";s:7:"content";s:83:"<ul>
<li>Устранена проблема установки РРЦ</li>
</ul>";s:8:"datetime";s:19:"2020-07-31 15:50:11";}i:3;a:3:{s:7:"version";s:5:"1.6.8";s:7:"content";s:175:"<ul>
<li>Исправлен функционал импорта значений в дополнительные поля плагинов и приложений</li>
</ul>";s:8:"datetime";s:19:"2020-07-24 11:37:04";}i:4;a:3:{s:7:"version";s:5:"1.6.7";s:7:"content";s:134:"<ul>
<li>Исправлен баг загрузки изображений с знаком вопроса в ссылке</li>
</ul>";s:8:"datetime";s:19:"2020-06-19 16:37:05";}i:5;a:3:{s:7:"version";s:5:"1.6.6";s:7:"content";s:141:"<ul>
<li>исправлена ошибка значения по умолчанию для ступенчатой наценки</li>
</ul>";s:8:"datetime";s:19:"2020-06-18 10:26:41";}i:6;a:3:{s:7:"version";s:5:"1.6.5";s:7:"content";s:85:"<ul>
<li>исправлен баг ступенчатой наценки</li>
</ul>";s:8:"datetime";s:19:"2020-06-05 11:24:23";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:12:"yandexmarket";a:11:{s:4:"name";s:25:"Яндекс.Маркет";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:79:"//www.webasyst.com/wa-data/public/updates/img/85/85/icon.ru_RU.png?v=2.3.13.122";s:5:"icons";a:1:{i:200;s:74:"//www.webasyst.com/wa-data/public/updates/img/85/85/icon.200x110.ru_RU.png";}s:10:"commercial";b:0;s:7:"version";s:10:"2.3.13.122";s:12:"download_url";s:75:"http://www.webasyst.com/download/archive/wa-apps/shop/plugins/yandexmarket/";s:12:"requirements";a:3:{s:7:"php.dom";a:2:{s:6:"strict";b:1;s:5:"value";i:1;}s:8:"app.shop";a:2:{s:6:"strict";b:1;s:7:"version";s:5:"8.4.6";}s:13:"app.installer";a:2:{s:6:"strict";b:1;s:7:"version";s:6:"1.11.9";}}s:9:"changelog";a:2:{i:0;a:3:{s:7:"version";s:10:"2.3.13.122";s:7:"content";s:413:"<ul>
   <li>Реализовали экспорт специальных цен товаров, изменённых плагинами, в элементах YML-файла <em>discount-price</em>.</li>
   <li>Скорректировали работу плагина в соответствии с требованиями «Яндекс.Маркета» к экспорту промокодов.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:40:49";}i:1;a:3:{s:7:"version";s:10:"2.3.12.116";s:7:"content";s:313:"<ul>
    <li>Возможность изменить количество товаров, выгружаемых в YML-файл в рамках каждого цикла экспорта, с помощью параметра конфигурации плагина <code>products_per_request</code>.</li>
</ul>";s:8:"datetime";s:19:"2020-08-11 14:40:48";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}}}s:4:"site";a:11:{s:4:"name";s:8:"Сайт";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:74:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.png?v=2.5.19.233";s:5:"icons";a:4:{i:96;s:67:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.96x96.png";i:48;s:67:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.48x48.png";i:24;s:67:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.24x24.png";i:16;s:67:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.16x16.png";}s:10:"commercial";b:0;s:7:"version";s:10:"2.5.19.233";s:12:"download_url";s:54:"http://www.webasyst.com/download/archive/wa-apps/site/";s:12:"requirements";a:2:{s:3:"php";a:2:{s:6:"strict";b:1;s:7:"version";s:8:">=5.6.25";}s:13:"app.installer";a:2:{s:7:"version";s:12:">=1.14.7.563";s:6:"strict";b:1;}}s:9:"changelog";a:5:{i:0;a:3:{s:7:"version";s:10:"2.5.19.233";s:7:"content";s:451:"<ul>
   <li>Исправили обновление содержимого списков товаров Shop-Script, опубликованных на страницах «Сайта».</li>
   <li>Устранили дефект формы обратной связи, которая формируется стандартным блоком <em>site.send_email_form</em>, при просмотре сайта на смартфоне.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:38:44";}i:1;a:3:{s:7:"version";s:10:"2.5.18.229";s:7:"content";s:322:"<ul>
    <li>Формирование заголовка Last-Modified для страниц сайта.</li>
</ul>
<strong>Тема дизайна «Дефолт»</strong>:
<ul>
    <li>Подсказка для настройки «Отображение длинных списков товаров».</li>
</ul>";s:8:"datetime";s:19:"2020-08-11 14:39:10";}i:2;a:3:{s:7:"version";s:10:"2.5.17.224";s:7:"content";s:163:"<ul>
    <li>Исправление незначительных ошибок, связанных с работой других приложений.</li>
</ul>";s:8:"datetime";s:19:"2020-07-13 12:38:12";}i:3;a:3:{s:7:"version";s:10:"2.5.16.221";s:7:"content";s:255:"<strong>Тема дизайна «Дефолт»</strong>:
<ul>
    <li>Улучшен формат указания информации об адресе favicon-файла для разных браузеров и веб-сервисов.</li>
</ul>";s:8:"datetime";s:19:"2020-06-10 14:23:53";}i:4;a:3:{s:7:"version";s:10:"2.5.15.218";s:7:"content";s:138:"<ul>
    <li>Улучшение диалога загрузки файлов в разделе «Файл-менеджер».</li>
</ul>";s:8:"datetime";s:19:"2020-04-28 12:52:15";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:4:"team";a:11:{s:4:"name";s:14:"Команда";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:74:"//www.webasyst.com/wa-data/public/updates/img/88/2588/icon.png?v=1.1.4.145";s:5:"icons";a:4:{i:96;s:68:"//www.webasyst.com/wa-data/public/updates/img/88/2588/icon.96x96.png";i:48;s:68:"//www.webasyst.com/wa-data/public/updates/img/88/2588/icon.48x48.png";i:24;s:68:"//www.webasyst.com/wa-data/public/updates/img/88/2588/icon.24x24.png";i:16;s:68:"//www.webasyst.com/wa-data/public/updates/img/88/2588/icon.16x16.png";}s:10:"commercial";b:0;s:7:"version";s:9:"1.1.4.145";s:12:"download_url";s:54:"http://www.webasyst.com/download/archive/wa-apps/team/";s:12:"requirements";a:1:{s:13:"app.installer";a:2:{s:7:"version";s:12:">=1.14.7.563";s:6:"strict";b:1;}}s:9:"changelog";a:7:{i:0;a:3:{s:7:"version";s:9:"1.1.4.145";s:7:"content";s:206:"<ul>
   <li>Исправили отображение актуальной информации о только что изменённых правах доступа пользователя.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:38:36";}i:1;a:3:{s:7:"version";s:9:"1.1.3.142";s:7:"content";s:686:"<ul>
   <li>Возможность для нового приглашённого пользователя войти в первый раз с использованием Webasyst ID.</li>
   <li>Возможность включения и отключения входа с Webasyst ID для пользователей без доступа к приложению «Команда».</li>
   <li>Исправлено обновление информации о правах доступа пользователя сразу после смены уровня доступа.</li>
   <li>Устранена ошибка PHP в настройках статуса.</li>
</ul>";s:8:"datetime";s:19:"2020-09-24 14:23:36";}i:2;a:3:{s:7:"version";s:9:"1.1.2.140";s:7:"content";s:170:"<ul>
    <li>Исправлено сохранение административных прав доступа для новых пользователей.</li>
</ul>";s:8:"datetime";s:19:"2020-08-11 14:38:40";}i:3;a:3:{s:7:"version";s:9:"1.1.1.137";s:7:"content";s:91:"<ul>
    <li>Исправление незначительных ошибок.</li>
</ul>";s:8:"datetime";s:19:"2020-07-02 15:38:08";}i:4;a:3:{s:7:"version";s:9:"1.1.0.136";s:7:"content";s:141:"<ul>
    <li>Возможность включить вход через Webasyst ID в профиле пользователя.</li>
</ul>";s:8:"datetime";s:19:"2020-06-25 14:01:48";}i:5;a:3:{s:7:"version";s:10:"1.0.12.135";s:7:"content";s:455:"<ul>
    <li>Длина пароля, который может ввести пользователь, ограничена 255 символами.</li>
    <li>Восстановлена сортировка пользователей в разделе «Офлайн» по времени их последнего присутствия в режиме онлайн.</li>
    <li>Улучшена система безопасности.</li>
</ul>";s:8:"datetime";s:19:"2020-06-10 14:24:12";}i:6;a:3:{s:7:"version";s:10:"1.0.11.130";s:7:"content";s:1018:"<ul> 
    <li>Новые возможности:
        <ul> 
            <li>Раздел «Токены API» с возможностью просмотра списка и удаления выданных токенов для обращения к API Вебасиста.</li> 
        </ul>
    </li> 
    <li>Улучшения:
        <ul> 
            <li>Отображение имён добавленных и отредактированных пользователей в «Ленте событий».</li> 
            <li>Сортировка пользователей по имени в разделе «Доступ».</li> 
            <li>Сортировка названий приложений в настройках доступа пользователей и групп.</li> 
            <li>Отображение многострочных описаний в контактной информации пользователей.</li> 
        </ul>
     </li> 
</ul>";s:8:"datetime";s:19:"2020-04-28 12:52:08";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:18:"wa-plugins/payment";a:1:{s:7:"plugins";a:1:{s:11:"yandexkassa";a:11:{s:4:"name";s:53:"Яндекс.Касса (новый протокол)";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:79:"//www.webasyst.com/wa-data/public/updates/img/98/5198/icon.ru_RU.png?v=1.2.0.36";s:5:"icons";a:1:{i:200;s:76:"//www.webasyst.com/wa-data/public/updates/img/98/5198/icon.200x110.ru_RU.png";}s:10:"commercial";b:0;s:7:"version";s:8:"1.2.0.36";s:12:"download_url";s:72:"http://www.webasyst.com/download/archive/wa-plugins/payment/yandexkassa/";s:12:"requirements";a:1:{s:13:"app.installer";a:4:{s:7:"version";s:6:">=1.13";s:6:"strict";b:1;s:4:"name";s:0:"";s:11:"description";s:0:"";}}s:9:"changelog";a:4:{i:0;a:3:{s:7:"version";s:8:"1.2.0.36";s:7:"content";s:297:"<ul>
   <li>Исправили отображение актуальной информации о статусе платежа после возврата на сайт.</li>
   <li>Исправили ошибку в работе плагина совместно с Shop-Script 6.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:39:50";}i:1;a:3:{s:7:"version";s:8:"1.1.5.33";s:7:"content";s:418:"<ul>
    <li>Поддержка редактирования заказа, когда средства покупателя заблокированы при использовании двухстадийной оплаты.</li>
    <li>Передача значений товарных кодов (кодов маркировки) из приложения для фискализации чеков.</li>
</ul>";s:8:"datetime";s:19:"2020-08-11 14:40:32";}i:2;a:3:{s:7:"version";s:8:"1.1.4.31";s:7:"content";s:140:"<ul>
    <li>Исправлено использование значения настройки «Способ оплаты».</li>
</ul>";s:8:"datetime";s:19:"2020-06-10 14:24:20";}i:3;a:3:{s:7:"version";s:8:"1.1.3.29";s:7:"content";s:157:"<ul>
    <li>Поддержка частичного списания при использовании двухстадийной оплаты.</li>
</ul>";s:8:"datetime";s:19:"2020-04-28 12:53:39";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}}}s:19:"wa-plugins/shipping";a:1:{s:7:"plugins";a:4:{s:8:"boxberry";a:11:{s:4:"name";s:8:"Boxberry";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:79:"//www.webasyst.com/wa-data/public/updates/img/28/5028/icon.ru_RU.png?v=1.1.0.38";s:5:"icons";a:1:{i:200;s:76:"//www.webasyst.com/wa-data/public/updates/img/28/5028/icon.200x110.ru_RU.png";}s:10:"commercial";b:0;s:7:"version";s:8:"1.1.0.38";s:12:"download_url";s:70:"http://www.webasyst.com/download/archive/wa-plugins/shipping/boxberry/";s:12:"requirements";a:2:{s:3:"php";a:4:{s:7:"version";s:5:">=5.6";s:6:"strict";b:1;s:4:"name";s:0:"";s:11:"description";s:0:"";}s:13:"app.installer";a:4:{s:7:"version";s:8:">=1.14.5";s:6:"strict";b:1;s:4:"name";s:0:"";s:11:"description";s:0:"";}}s:9:"changelog";a:2:{i:0;a:3:{s:7:"version";s:8:"1.1.0.38";s:7:"content";s:395:"<ul>
   <li>Плагин доработан для пользователей из Беларуси и Казахстана.</li>
   <li>Добавили возможность отслеживания статуса отправления в личном кабинете и на странице заказа в интерфейсе администратора магазина.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:39:56";}i:1;a:3:{s:7:"version";s:9:"1.0.11.34";s:7:"content";s:320:"<ul>
    <li>Передача габаритов отправления в личный кабинет на сайте службы доставки.</li>
    <li>Исправлено создание отправлений в личном кабинете при использовании налогов.</li>
</ul>";s:8:"datetime";s:19:"2020-07-13 12:40:15";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:7:"courier";a:11:{s:4:"name";s:12:"Курьер";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:78:"//www.webasyst.com/wa-data/public/updates/img/23/123/icon.ru_RU.png?v=1.4.9.62";s:5:"icons";a:1:{i:200;s:75:"//www.webasyst.com/wa-data/public/updates/img/23/123/icon.200x110.ru_RU.png";}s:10:"commercial";b:0;s:7:"version";s:8:"1.4.9.62";s:12:"download_url";s:69:"http://www.webasyst.com/download/archive/wa-plugins/shipping/courier/";s:12:"requirements";a:1:{s:13:"app.installer";a:4:{s:6:"strict";b:1;s:7:"version";s:2:">0";s:4:"name";s:0:"";s:11:"description";s:0:"";}}s:9:"changelog";a:3:{i:0;a:3:{s:7:"version";s:8:"1.4.9.62";s:7:"content";s:388:"<ul>
   <li>Добавили проверку правильности желаемой даты доставки, введённой покупателем.</li>
   <li>Отключили срабатывание автозаполнения браузера в поле для ввода желаемой даты доставки при оформлении заказа.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:40:03";}i:1;a:3:{s:7:"version";s:8:"1.4.8.59";s:7:"content";s:402:"<ul>
    <li>Добавлена возможность сохранять в настройках желаемые интервалы времени доставки с указанием минут.</li>
    <li>Исправлен доступный диапазон дат для выбора желаемой даты доставки во время оформления заказа.</li>
</ul>";s:8:"datetime";s:19:"2020-06-10 14:24:28";}i:2;a:3:{s:7:"version";s:8:"1.4.7.57";s:7:"content";s:213:"<ul>
    <li>Добавлена подсказка для поля настроек «Карты».</li>
    <li>Исправлен выбор региона доставки в настройках.</li>
</ul>";s:8:"datetime";s:19:"2020-04-28 12:53:10";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:11:"russianpost";a:11:{s:4:"name";s:34:"Почта России (Webasyst)";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:78:"//www.webasyst.com/wa-data/public/updates/img/26/126/icon.ru_RU.png?v=1.6.4.60";s:5:"icons";a:1:{i:200;s:75:"//www.webasyst.com/wa-data/public/updates/img/26/126/icon.200x110.ru_RU.png";}s:10:"commercial";b:0;s:7:"version";s:8:"1.6.4.60";s:12:"download_url";s:73:"http://www.webasyst.com/download/archive/wa-plugins/shipping/russianpost/";s:12:"requirements";a:2:{s:6:"php.gd";a:4:{s:11:"description";s:16:"Printfom display";s:6:"strict";b:0;s:5:"value";i:1;s:4:"name";s:0:"";}s:13:"app.installer";a:4:{s:6:"strict";b:1;s:7:"version";s:2:">0";s:4:"name";s:0:"";s:11:"description";s:0:"";}}s:9:"changelog";a:1:{i:0;a:3:{s:7:"version";s:8:"1.6.4.60";s:7:"content";s:111:"<ul>
    <li>Улучшена проверка числовых значений настроек.</li>
</ul>";s:8:"datetime";s:19:"2020-04-28 12:52:57";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:2:"sd";a:11:{s:4:"name";s:38:"Пункт выдачи заказов";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:79:"//www.webasyst.com/wa-data/public/updates/img/57/4357/icon.ru_RU.png?v=1.0.9.40";s:5:"icons";a:1:{i:200;s:76:"//www.webasyst.com/wa-data/public/updates/img/57/4357/icon.200x110.ru_RU.png";}s:10:"commercial";b:0;s:7:"version";s:8:"1.0.9.40";s:12:"download_url";s:64:"http://www.webasyst.com/download/archive/wa-plugins/shipping/sd/";s:12:"requirements";a:1:{s:13:"app.installer";a:4:{s:6:"strict";b:1;s:7:"version";s:2:">0";s:4:"name";s:0:"";s:11:"description";s:0:"";}}s:9:"changelog";a:1:{i:0;a:3:{s:7:"version";s:8:"1.0.9.40";s:7:"content";s:292:"<ul>
   <li>Сделали доступным выбор пунктов самовывоза при создании или редактировании заказа администратором магазина, когда ещё не указан адрес доставки.</li>
</ul>";s:8:"datetime";s:19:"2020-10-19 10:40:17";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}}}}}