Repository: kosmosby/shop
Catalog: *-apps/shop/plugins/revolutionslider/locale/*/LC_MESSAGES/shop_revolutionslider.po
Languages: ru_ru

source: Defines the rotation degree of the SlideMain image at the start of the Ken Burns Effect. Use small values (positive or negative). i.e. “-5” for a smooth and clever effect.
ru_ru: Определяет Градус поворота фона в начале эффекта Ken Burns Effect. Чем меньше значение (положительное или отрицательно) тем чище получится эффект. Например: "-5"

source: Start Rotation
ru_ru: Поворот на Старте

source: Defines the rotation degree of the Slide Main image at the end of the Ken Burns Effect. Use small values (positive or negative). i.e. “-5” for a smooth and clever effect.
ru_ru: Определяет Градус поворота фона в конце эффекта Ken Burns Effect. Чем меньше значение (положительное или отрицательно) тем чище получится эффект. Например: "5"

source: Finish Rotation
ru_ru: Поворот в конце

source: General
ru_ru: Основное

source: Arrows
ru_ru: Стрелки

source: Bullets
ru_ru: Маркеры

source: Thumbs
ru_ru: Миниатюры

source: Tabs
ru_ru: Табы

source: Allows to enable/disable the keyboard navigation.
ru_ru: Если отмечено, слайдер можно будет перелистывать стрелками на клавиатуре

source: Keyboard
ru_ru: Клавиатура

source: <strong>horizontal</strong> or <strong>vertical</strong> – use up/down or left/right arrows key for the navigation
ru_ru: <strong>Горизонтальное</strong>- использует для управления стрелки вправо/влево;<br><strong>Вертикальное</strong> – использует для управления стрелки вверх/вниз

source: Direction
ru_ru: Направление

source: Vertical
ru_ru: Вертикальное

source: Horizontal
ru_ru: Горизонтальное

source: Allows mouse scroll based slide navigation.
ru_ru: Если отмечено, слайдером можно будет пролистывать с помощью колесика мышки.

source: Slider progress is stopped when Slider is hovered. Will not stop the Layer animations, only the Slider Progress Bar
ru_ru: Воспроизведение Слайдера будет остановлено, когда курсор мышки будет находится над Слайдером.

source: Stop on Hover
ru_ru: Hover стоп

source: Enable/Disable the Touch function for none Carousel Sliders
ru_ru: Если отмечено, то слайдер можно будет перелистывать на тач-скрин устройствах.

source: Touch
ru_ru: Тач

source: If checked, Navigation arrows will be created for the Slider.
ru_ru: Активирует Стрелки Навигации

source: Style
ru_ru: Стиль

source: Ares
ru_ru: Арес

source: Dionis
ru_ru: Дионис

source: Poseidon
ru_ru: Посейдон

source: Demetra
ru_ru: Диметра

source: Jupiter
ru_ru: Юпитер

source: Venus
ru_ru: Венера

source: Hephaestus
ru_ru: Гефест

source: Hermes
ru_ru: Гермес

source: Aphrodite
ru_ru: Афродита

source: Persephone
ru_ru: Персифона

source: Uranus
ru_ru: Уран

source: Zeus
ru_ru: Зевс

source: If checked, the Navigation Arrows are hide on on Mobile Devices
ru_ru: Если отмечено, скроет Стрелки на мобильных устройствах

source: Hide on Mobile
ru_ru: Прятать на Мобильных

source: Hide navigation arrows when mouse live slider container
ru_ru: Если отмечено, слайдер будет скрывать стрелки навигации, когда курсор покидает область слайдера

source: Hide on Leave
ru_ru: Всегда показывать

source: After how many “ms” the Navigation arrows fade out.
ru_ru: Через сколько миллисекунд скрывать стрелки после того, как курсор покинет слайдер

source: Hide Delay
ru_ru: Задержка

source: After how many “ms” the Navigation arrows fade out on mobile devices.
ru_ru: Через сколько миллисекунд, стрелки навигации будут скрыты на мобильных устройствах.

source: Mobile Hide Delay
ru_ru: Задержка для мобильных

source: Left Arrow
ru_ru: Левая Стрелка

source: The Horizontal Align of the Left Arrow within the Slider.
ru_ru: Горизонтальное расположение Левой стрелки внутри Слайдера.

source: Horizontal Align
ru_ru: По горизонтали

source: The Vertical Align of the Left Arrow within the Slider.
ru_ru: Вертикальное расположение Левой стрелки внутри Слайдера.

source: Vertical Align
ru_ru: По вертикали

source: Top
ru_ru: Сверху

source: Bottom
ru_ru: Снизу

source: The Horizontal offset in px from the Aligned position. Negative Values on left aligned elements will move left
ru_ru: Горизонтальный сдвиг в пикселях от текущей позиции элемента навигации. Негативное значение сдвинет элемент влево

source: Horizontal Offset
ru_ru: Горизонтальный Сдвиг

source: The Vertical offset in px from the Aligned position. Negative Values on top aligned elements will move top
ru_ru: Вертикальный сдвиг в пикселях от текущей позиции элемента навигации. Негативное значение сдвинет элемент вверх

source: Vertical Offset
ru_ru: Вертикальный сдвиг

source: Right Arrow
ru_ru: Правая Стрелка

source: The Horizontal Align of the Right Arrow within the Slider.
ru_ru: Горизонтальное расположение Правой Стрелки внутри Слайдера

source: The Vertical Align of the Right Arrow within the Slider.
ru_ru: Вертикальное расположение Правой Стрелки внутри Слайдера

source: If checked, Navigation Bullets will be created for the Slider.
ru_ru: Активирует Навигационные Маркеры

source: If checked, the Navigation bullets are hide on on Mobile Devices
ru_ru: Если отмечено, Маркеры будут скрыты на мобильных устройствах

source: Hide navigation bullets when mouse live slider container
ru_ru: Маркеры будут скрываться, когда курсор мышки покидает слайдер

source: After how many “ms” the Navigation bullets fade out.
ru_ru: Через сколько миллисекунд Скрывать Маркеры

source: After how many “ms” the Navigation bullets fade out on mobile devices.
ru_ru: Через сколько миллисекунд скрывать Маркеры на мобильных устройствах

source: The Direction of the Bullets.<br> <strong>Vertical</strong> or <strong>Horizontal</strong>
ru_ru: Направление Маркеров<br> <strong>Вертикальное</strong> или <strong>Горизонтальное</strong>

source: The Horizontal Align of the Bullets within the Slider.
ru_ru: Горизонтальное расположение Маркеров внутри слайдера

source: The space between single Bullet Points in px
ru_ru: Расстояние в пикселях между Маркерами

source: Space
ru_ru: Отступ между

source: If checked, Navigation Thumbs will be created for the Slider.
ru_ru: Активирует Навигационные Миниатюры

source: Thumb width in px
ru_ru: Ширина Миниатюры в пикселях

source: Thumb height in px
ru_ru: Высота миниатюры в пикселях

source: The maximum visible amount of Thumbs in the same time. If more thumbs exist, the Thumbs becomes Draggable and scrollable. If less, the amount of Thumbs will be equal to the amount of existing thumbs.
ru_ru: Максимальное количество одновременно видимых Миниатюр. Если миниатюр больше, чем установлено в этой опции, часть из них будет скрыта, а список миниатюр можно будет пролистать.

source: Visible Amount
ru_ru: Видимое Кол-во

source: The background color of the Thumbnails Wrapper Container
ru_ru: Фон контейнера Миниатюры

source: The opacity of the background of the Thumbnais Wrapper Container
ru_ru: Прозрачность контейнера с Миниатюрой

source: If checked, the Navigation Thumbs are hide on on Mobile Devices
ru_ru: Если отмечено, Миниатюры будут скрыты на мобильных устройствах

source: Hide navigation Thumbs when mouse live slider container
ru_ru: Прятать миниатюры, когда курсор покидает слайдер

source: The Horizontal Align of the Thumnails within the Slider.
ru_ru: Горизонтальное расположение Миниатюр внутри слайдера

source: The Vertical Align of the Thumnails within the Slider.
ru_ru: Вертикальное расположение Миниатюр внутри слайдера

source: The Direction of the Thumbnails.<br> <strong>Vertical</strong> or <strong>Horizontal</strong>
ru_ru: Направление Миниатюр.<br> <strong>Горизонтальное</strong> или <strong>Вертикальное</strong>

source: Where the Thumbnails are drawn. Inner or Outer the Slider.
ru_ru: Где будут расположены Миниатюры, Внутри ил за пределами слайдера

source: Position
ru_ru: Позиция

source: Inside Slider
ru_ru: Внутри слайдера

source: Left outer
ru_ru: Слева от слайдера

source: Right outer
ru_ru: Справа от слайдера

source: Bottom outer
ru_ru: Под слайдером

source: Top Outer
ru_ru: Над слайдером

source: The space between single Thumbs in px.
ru_ru: Расстояние между Миниатюрами в пикселях

source: The Thumbnails Wrapped Container Padding in px
ru_ru: Внутренний отступ контейнера с миниатюрой в пикселях

source: Padding
ru_ru: Внутренний отступ

source: The Horizontal offset in px from the Aligned position. Negative Values on left aligned elements will move left, and negative values on right aligned elements will move right the element.
ru_ru: Горизонтальный сдвиг в пикселях от текущей позиции элемента навигации. Негативное значение для элемента, который расположен слева - сдвинет элемент вправо.

source: The Vertical offset in px from the Aligned position. Negative Values on top aligned elements will move top, and negative values on bottom aligned elements will move bottom the element.
ru_ru: Вертикальный сдвиг в пикселях от текущей позиции элемента навигации. Негативное значение для элемента, который расположен сверху - сдвинет элемент вниз.

source: If checked, Navigation Tabs will be created for the Slider.
ru_ru: Активирует Табы

source: Tab width in px
ru_ru: Ширина Таба в пикселях

source: Tab height in px
ru_ru: Высота Таба в пикселях

source: The maximum visible amount of Tabs in the same time. If more thumbs exist, the Tabs becomes Draggable and scrollable. If less, the amount of Tabs will be equal to the amount of existing.
ru_ru: Максимальное количество одновременно видимых Табов. Если табов больше, чем установлено в этой опции, часть из них будет скрыта, а список с табами можно будет пролистать.

source: The background color of the Tabs Wrapper Container
ru_ru: Фон контейнера с Табами

source: The opacity of the background of the Tabs Wrapper Container
ru_ru: Прозрачность контейнера с Табами

source: If checked, the Navigation Tabs are hide on on Mobile Devices
ru_ru: Если отмечено, Табы будут скрыты на мобильных Устройствах

source: Hide navigation Tabs when mouse live slider container
ru_ru: Прячет Табы, когда курсор мышки покидает пределы слайдера

source: The Horizontal Align of the Tabs within the Slider.
ru_ru: Горизонтальное расположение Табов внутри слайдера

source: The Vertical Align of the Tabs within the Slider.
ru_ru: Вертикальное расположение Табов внутри слайдера

source: The Direction of the Tabs.<br> <strong>Vertical</strong> or <strong>Horizontal</strong>
ru_ru: Направление Табов <br> <strong>Вертикальное</strong> или <strong>Горизонтальное</strong>

source: Where the Tabs are drawn. Inner or Outer the Slider.
ru_ru: Где будут расположены Табы, Внутри ил за пределами слайдера

source: The space between single Tabs in px
ru_ru: Расстояние между Табами в пикселях

source: The Tabs Wrapped Container Padding in px
ru_ru: Отступ внутри контейнера с Табами в пикселях

source: Tooltip button size in px
ru_ru: Размер кнопки Тултипа

source: Size
ru_ru: Размер

source: Button border color
ru_ru: Цвет границы кнопки

source: Button weight
ru_ru: Ширина кнопки

source: Button background color
ru_ru: Цвет фона кнопки

source: Start Animation
ru_ru: Начальная Анимация

source: Layer Start X axis position in px relatively to Slider Grid
ru_ru: Позиция слоя по оси X во время начальной анимации

source: Layer Start Y axis position in px relatively to Slider Grid
ru_ru: Позиция слоя по оси Y во время начальной анимации

source: Layer Start Z axis position in px relatively to Slider Grid
ru_ru: Позиция слоя по оси Z во время начальной анимации

source: Animation In Easing
ru_ru: Смягчение Начальной анимации

source: Duration of the Start Animation
ru_ru: Длительность Начальной анимации

source: Layer Opacity on start position
ru_ru: Прозрачность слоя на начальной позиции

source: Layer horizontal scale on start position<br> The value between 0 and 100, 1 = 100% of layer horizontal size
ru_ru: Горизонтальное Искажение слоя на начальной позиции<br> Значение между 0 и 100, 1 = 100% горизонтального размера слоя

source: Layer vertical scale on start position<br> The value between 0 and 100, 1 = 100% of layer vertical size
ru_ru: Вертикальное Искажение слоя на начальной позиции<br> Значение между 0 и 100, 1 = 100% горизонтального размера слоя

source: Horizontal axis rotation degree on start position<br> The value between -1200 and 1200
ru_ru: Градус Вращения слоя по Горизонтали на начальной позиции<br> Значение между -1200 и 1200

source: Vertical axis rotation degree on start position<br> The value between -1200 and 1200
ru_ru: Градус Вращения слоя по Вертикали на начальной позиции<br> Значение между -1200 и 1200

source: Horizontal skew on start position.<br> The value between -100 and 100<br> 0 - no skew
ru_ru: Наклон слоя по Горизонтали на начальной позиции.<br>Значение между -100 и 100<br> 0 - без поворота

source: Vertical skew on start position.<br> The value between -100 and 100<br> 0 - no skew
ru_ru: Наклон слоя по Вертикали на начальной позиции.<br>Значение между -100 и 100<br> 0 - без поворота

source: Slider saved successfully!
ru_ru: Слайдер успешно сохранен!

source: Are sure want to delete this Layer?
ru_ru: Вы действительно хотите удалить этот Слой?

source: Slider Settings
ru_ru: Настройки Слайдера

source: Meta
ru_ru: Мета

source: Thumb
ru_ru: Миниатюра

source: Delete Slide
ru_ru: Удалить Слайд

source: Duplicate Slide
ru_ru: Создать дубликат

source: Layers
ru_ru: Слои

source: Add New Layer
ru_ru: Добавить Новый Слой

source: Back to Slider List
ru_ru: Назад к списку слайдеров

source: Appearance
ru_ru: Внешний вид

source: Parallax & 3D
ru_ru: Параллакс и 3D

source: Save
ru_ru: Сохранить

source: Slider Preview
ru_ru: Просмотреть

source: Reorder Slides
ru_ru: Изменить порядок Слайдов

source: Add Slide
ru_ru: Добавить Слайд

source: Slide Background Color
ru_ru: Цвет фона слайдера

source: Upload Background Image
ru_ru: Загрузить фоновое изображение

source: Remove image
ru_ru: Удалить изображение

source: Define how the background image will be repeated
ru_ru: Как будет повторяться фон

source: BG Repeat
ru_ru: Повторение

source: Repeat
ru_ru: Повторять

source: No Repeat
ru_ru: Не повторять

source: Repeat X
ru_ru: Повторять по оси X

source: Repeat Y
ru_ru: Повторять по оси Y

source: Define Background Image size.<br><strong>Auto</strong> - Default value. The background-image contains its width and height<br><strong>Cover</strong> - Scale the background image to be as large as possible so that the background area is completely covered by the background image. Some parts of the background image may not be in view within the background positioning area Play it »<br><strong>Contain</strong> - Scale the image to the largest size such that both its width and its height can fit inside the content area
ru_ru: Определяет размер фонового изображения.<br><strong>Автоматически</strong> - Значение по умолчанию. Реальный размеры фонового изображения;<br><strong>Cover</strong> - Масштабирует фоновое изображение с сохранением пропорций так, чтобы его ширина или высота равнялась ширине или высоте слайдера;<br><strong>Contain</strong> - Масштабирует фоновое изображение с сохранением пропорций таким образом, чтобы оно целиком поместилась внутрь слайдера.

source: BG Size
ru_ru: Масштаб

source: Define Background Image alignment relatively to the slider sides
ru_ru: Определят позицию фона внутри слайдера

source: BG Position
ru_ru: Позиция

source: Top Right
ru_ru: Сверху справа

source: Top Left
ru_ru: Сверху слева

source: Bottom Right
ru_ru: Снизу справа

source: Bottom Left
ru_ru: Снизу слева

source: Defint the Depth of Background parallax effect
ru_ru: Определяет глубину Параллакс эффекта

source: Padding (top, right, bottom, left)
ru_ru: Внутренний отступ (сверху, справа, снизу, слева)

source: X axis rotation degree position<br> The value between -1200 and 1200
ru_ru: Вращение по горизонтали<br>Значение между -1200 и 1200

source: Y axis rotation degree position<br> The value between -1200 and 1200
ru_ru: Вращение по вертикали<br>Значение между -1200 и 1200

source: Z axis rotation degree position<br> The value between -1200 and 1200
ru_ru: Вращение по оси Z<br>Значение между -1200 и 1200

source: Line
ru_ru: Высота

source: Color
ru_ru: Цвет

source: More
ru_ru: Дополнительно

source: top-left
ru_ru: сверху-слева

source: top-right
ru_ru: сверху-справа

source: bot-right
ru_ru: снизу-справа

source: bot-left
ru_ru: снизу-слева

source: Text Align
ru_ru: Выровнять

source: Decoration
ru_ru: Декор

source: X position
ru_ru: X позиция

source: Y position
ru_ru: Y позиция

source: Z position
ru_ru: Z позиция

source: Hide Layer on artboard
ru_ru: Скрыть на монтажной

source: Delete Layer
ru_ru: Удалить

source: Dubplicate Layer
ru_ru: Создать дубликат

source: Толщина границы
ru_ru: Создать дубликат

source: Left Offset
ru_ru: Отступ слева

source: Change this value to move tooltip wrapper left or right
ru_ru: Изменяйте этот параметр, чтобы сдвинуть подсказку вправо или лево

source: Top Offset
ru_ru: Отступ сверху

source: Change this value to move tooltip wrapper top or bottom
ru_ru: Изменяйте этот параметр, чтобы сдвинуть подсказку вниз или вверх

source: Border weight
ru_ru: Толщина

source: Type of layer container
ru_ru: Тип контейнера

source: Layout
ru_ru: Разметка

source: Search...
ru_ru: Поиск...

source: Add New Folder
ru_ru: Добавить папку

source: Delete Folder
ru_ru: Удалить папку

source: New Group
ru_ru: Новая Группа

source: Not Grouped
ru_ru: Без группы

source: Slider group
ru_ru: Группа

source: Back to Root
ru_ru: Вернуться

source: Are sure want to delete this folder?
ru_ru: Вы уверены, что хотите удалить эту папку? После удаления все слайдеры из этой папки перенесутся в основной список

source: Copied to clipboard...
ru_ru: Скопировано в буфер...

source: Click to edit...
ru_ru: Клик, чтобы изменить...

source: Saving...
ru_ru: Сохраняем...

source: Use the shortcode below to add slider to Site, Blog or Photo app
ru_ru: Чтобы вставить слайдер в приложения Сайт, Блог или Фото используйте код ниже

source: Tooltip height
ru_ru: Высота Тултипа
