Repository: kosmosby/shop
Catalog: *-apps/shop/plugins/revolutionslider/locale/*/LC_MESSAGES/shop_revolutionslider.po
Languages: ru_ru

source: Select Transition effect for Slider change animation
ru_ru: Выберитие эффект анимации при смене слайда

source: Transition Effect
ru_ru: Эффект Перехода

source: This option defines the duration of the Transition in ms (milliseconds). The value “default” is also accepted which will pick the best Duration for the selected Transition.
ru_ru: Этот параметр определяет длительность Анимации Перехода в ms (миллисекунды). Значение "default" определяет наиболее подходящее время для выбранного эффекта.

source: Transition Speed
ru_ru: Скорость перехода

source: The number of slots or slices the Slide image is “split” to in the transition. Only available for Transitions with Slots and Slices
ru_ru: Количество слотов или фрагментов, на которые будет разделен фон при использовании Slots и Slices эффектов перехода

source: Slots
ru_ru: Слоты

source: The rotation of the Single Slots/Slices, or full image during the Transition. Some transition will ignore this value. Negative and Positive values are allowed. (i.e. -360, or 180 etc..)
ru_ru: Градус поворота отдельного Слота/Фрагмента, или всего фона, в зависимости от выбранного эффекта перехода. Некоторые эффекты перехода не используют этот параметр.

source: The In animation Easing. If you dont know how you wish to ease the animation, simple do not define it, or use the value “default” which will pick the best ease per transition type.
ru_ru: Смягчение для Стартовой Анимации.

source: Start Easing
ru_ru: Анимация на Старте

source: The Out animation Easing. If you dont know how you wish to ease the animation, simple do not define it, or use the value “default” which will pick the best ease per transition type.
ru_ru: Смягчение для Финишной Анимации.

source: Finish Easing
ru_ru: Анимация на Финише

source: Value is in milliseconds. Describes the length of the slide in ms.
ru_ru: Значение в ms(миллисекундах). Определяет продолжительность слайда.

source: Duration
ru_ru: Продолжительность

source: Custom Css
ru_ru: Свой CSS

source: Defines the Event type of the Parallax sensibility.<br><strong>Off</strong> - No Parallax Effect enabled Globally;<br> <strong>Mouse</strong> - elements will follow the mouse pointer movements over the sliders;<br><strong>Scroll</strong> - elements will follow the scroll positions<br><strong>Scroll+Mouse</strong> - elements will vertical follow the scroll positions, and horizontal follow the mouse positions <br><strong>3D</strong> - Just select and see it in action
ru_ru: <strong>Выкл</strong> - Параллакс отключен;<br> <strong>Мышка</strong> - элементы следуют за курсором мышки, когда он находится над слайдером;<br><strong>Скролл</strong> - элементы будут следовать за позицией скролла<br><strong>Мышка+Скролл</strong> - элементы будут следовать вертикльно за позицией скролла, горизонтально - за позицией курсора<br><strong>3D</strong> -Просто включите и проверьте в действии

source: Effect Type
ru_ru: Тип Эффекта

source: Off
ru_ru: Выкл

source: Mouse
ru_ru: Мышка

source: Scroll
ru_ru: Скролл

source: Mouse + Scroll
ru_ru: Мышка+Скролл

source: Defines the calculation base of the parallax direction and distances.<br><strong>Slider Center</strong> - distance between mouse and slider center will be calculated. The outer side of slider is -100% / 100% and the center is 0%. Elements will be transformed like “distance percent” * “responsive strength of element” in vertical and horizontal direction;<br><strong>Enter Point</strong> - distance between mouse enter point and current mouse point will be calculated. Elements will be transformed like “distance percent” * “responsive strength of element” in vertical and horizontal direction
ru_ru: Определяет базу для вычисления направления и расстояния эффекта.<br><strong>Центр Слайдера</strong> - направление и расстояние элементов рассчитывается относительно центра слайдера<br><strong>Точка Входа</strong> - направление и расстояние элементов рассчитывается относительно точки входа курсора в область слайдера.

source: Orign
ru_ru: База

source: Enter Point
ru_ru: Точка Входа

source: Slider Center
ru_ru: Центр Слайдера

source: If checked - enable Background Parallax effects. Still, you will need to set the Parallax Effect per Slide Background
ru_ru: Если отмечено - активирует Параллакс для Фона.

source: Background
ru_ru: Фон

source: Disable Parallax Effect on mobiles for better Performance and smoother effects.
ru_ru: Отключить Параллакс Эффект на мобильных устройствах.

source: Disable on Mobile
ru_ru: Отключить на Мобильных

source: The speed of the position transform of element. 400 will move the elements in 0.4s.
ru_ru: Скорость смены позиции элемента в ms (миллисекунды). К примеру 400 - трансформация произойдет за 0,4 секунды.

source: Speed
ru_ru: Скорость

source: 3D Settings
ru_ru: Настройки 3D

source: Add Shadow effect to each Layer
ru_ru: Добавит тень к каждому слою, для имитации объема

source: Shadow
ru_ru: Тень

source: If checked - disable Background 3D effect.
ru_ru: Если отмечено - отключит 3D эффект для фона слайда.

source: Background Freeze
ru_ru: Заморозить Фон

source: If checked, all Slides and Layers are cropped by the Slider sides
ru_ru: Если отмечено, Слайды и Слои не будут выходить за пределы контейнера в котором находится слайдер.

source: Slider Overflow
ru_ru: Перекрытие

source: If checked, Layers are cropped by the Grid dimensions to avoid Floated 3D Text and hide elements outside of the Slider
ru_ru: Если отмечено - Слои не будут выходить за пределы Рабочей области Слайдера.

source: Layers Overflow
ru_ru: Перекрытие Слоев

source: Solves issues in Safari Browser. It will move layers along Z axis if Background Freeze enabled to avoid 3D Renderig issues.
ru_ru: Во время эффекта будет так же передвигать элементы по оси Z, во избежание проблем во время 3D рендеринга, когда происходит обрезка слоя.

source: Tooltip weight
ru_ru: Ширина Тултипа

source: Weight
ru_ru: Ширина

source: Title color
ru_ru: Цвет Заголовка

source: Description color
ru_ru: Цвет описания

source: Background color
ru_ru: Цвет Фона

source: Text or HTML
ru_ru: Текст или HTML

source: Defines the way how the line should break based on the width and height settings of the Layer.<br> <strong>nowrap<strong> – will not auto break the line. Text will overflow the container if it has set smaller (not auto or none).<br> <strong>normal</strong> – content will auto line break based on the layer width
ru_ru: Определяет как будут переноситься текст.

source: Whitespace
ru_ru: Перенос Строк

source: normal
ru_ru: Переносить

source: nowrap
ru_ru: Не переносить

source: Initial Layer Animation will start from that time point.<br><strong>Value in milliseconds</strong>
ru_ru: Начальная / Стартовая Анимация Слоя, начнется с этого момента.<br><strong>Значение в миллисекундах</strong>

source: Start
ru_ru: Старт

source: Finish Layer Animation will start from that time point.<br><strong>Value in milliseconds</strong>
ru_ru: Финишная Анимация Слоя, начнется с этого момента.<br><strong>Значение в миллисекундах</strong>

source: Finish
ru_ru: Финиш

source: Current Horizontal position of Layer
ru_ru: Текущая Горизонтальная позиция Слоя

source: Current Vertical position of Layer
ru_ru: Текущая Вертикальная позиция Слоя

source: Content
ru_ru: Контент

source: Animation
ru_ru: Анимация

source: Styles
ru_ru: Стили

source: Parallax
ru_ru: Параллакс

source: Tooltip Title text
ru_ru: Заголовок Тултипа

source: Title
ru_ru: Заголовок

source: Tooltip Description text
ru_ru: Описание Тултипа

source: Description
ru_ru: Описание

source: Show Tooltip on the artboard
ru_ru: Отобразит Тултип на монтажной области

source: Show Tooltip
ru_ru: Показать Тултип

source: Button
ru_ru: Кнопка

source: Body
ru_ru: Подсказка

source: Define the depth of parallax effect
ru_ru: Определяет глубину Параллакс Эффекта

source: Depth
ru_ru: Глубина

source: Unique slide identificator
ru_ru: Уникальный Идентификатор Слайда

source: Slide ID
ru_ru: ID Слайда

source: Slide Title that can be used in navigation
ru_ru: Заголовок Слайда - может использоваться в навигации

source: Slide Description that can be used in navigation
ru_ru: Описание Слайда - может использоваться в навигации

source: Short Description
ru_ru: Краткое описание

source: Border color
ru_ru: Цвет Границы

source: Border style
ru_ru: Стиль Границы

source: none
ru_ru: нет

source: solid
ru_ru: линия

source: dashed
ru_ru: прочерк

source: dotted
ru_ru: точки

source: double
ru_ru: двойная

source: Border weight in px
ru_ru: Толщина Границы в px (пикселях)

source: Border radius (Top-left, Top-right, Bottom-right, Bottom-left
ru_ru: Радиус Границы (Верхний-левый, Верхний-правый, Нижний-правый, Нижний-левый)

source: Error
ru_ru: Ошибка

source: Are sure want to delete this Slider?
ru_ru: Вы действительно хотите удалить этот Слайдер?

source: Edit
ru_ru: Редактор

source: Duplicate
ru_ru: Дубликат

source: Insert
ru_ru: Вставить

source: Use the code below to insert slider into your theme
ru_ru: Используйте код ниже, для вставки слайдера в вашу Тему

source: Preview
ru_ru: Просмотр

source: Slider
ru_ru: Слайдер

source: Add New
ru_ru: Создать Новый

source: Template Library
ru_ru: Библиотека Шаблонов

source: Help
ru_ru: Помощь

source: Youtube
ru_ru: Видео

source: Update
ru_ru: Обновления

source: Report an error
ru_ru: Сообщить об ошибке

source: Suggest an Idea
ru_ru: Предложить Идею

source: Contact Developer
ru_ru: Связаться с разработчиком

source: Rate this Plugin
ru_ru: Оценить Плагин

source: Slider Name
ru_ru: Название Слайдера

source: Name
ru_ru: Название

source: <strong>Standart</strong> - Regular Slider with unlimited amount of slides, 1 Slide is focused and visible in the same time;<br><strong>Hero</strong> - Typical Hero Block usage with animated layers, where only 1 Slide is defined and visible;<br> <strong>Carousel</strong> - A horizontal carousel where unlimited amount of slides can be defined. 1 Slide is focused, more slide visible in the same time.
ru_ru: <strong>Слайд-шоу</strong> - Классическое слайд-шоу, с неограниченным количеством Слайдов/Слоев;<br><strong>Сцена</strong> - Только один слайд - подойдет для создания Презентаций продукта или других блоков, где не требуется смена слайдов;<br> <strong>Карусель</strong> - Горизонтальная карусель с неограниченным количеством элементов. В фокусе всегда находится только один слайд.

source: Slider Type
ru_ru: Тип Слайдера

source: Standart
ru_ru: Слайд-шоу

source: Hero
ru_ru: Сцена

source: Carousel
ru_ru: Карусель

source: Defines the Layout of the Slider which can be:<br> <strong>Auto</strong> - slider will always fill the wrapping container horizontal, following any horizontal sizes. Height of slider will be calculated based on the Grid Sizes and current browser size. Max. height of Slider will be equal to the current gridheight.<br> <strong>Full Width</strong> - slider will always fill the full width of the browser, independent of the wrapping containers width. Height of slider will be calculated based on the Grid Sizes and current browser size. Max. height of Slider will be equal to the current gridheight.<br><strong>Full Screen</strong> - slider width and height will follow the exact width and height of the Browser size
ru_ru: Определяет тип разметки Слайдера:<br> <strong>Автоматически</strong> - слайдер всегда находится в пределах контейнера, в который он вставлен. Высота вычисляется на основе размеров Рабочего контейнера и размеров окна браузера.<br> <strong>По ширине</strong> - слайдер всегда заполняет горизонтальную область по ширине окна браузера, игнорируя размеры контейнера в который он вставлен.<br><strong>Полноэкранный</strong> - ширина и высота браузера заполняют всю видимую область браузера

source: Auto
ru_ru: Автоматически

source: Full Width
ru_ru: По ширине

source: Full Screen
ru_ru: Полноэкранный

source: The width of slider grid in px
ru_ru: Ширина рабочего контейнера в px (пикселях)

source: Width
ru_ru: Ширина

source: The height of slider grid in px
ru_ru: Высота рабочего контейнера в px (пикселях)

source: Height
ru_ru: Высота

source: Value is in milliseconds. Describes the default (global) length of the slides in ms. Slides length can be individually set via Slide delay attribute. In case the slide has no individual length, it will pick this value.
ru_ru: Значение в миллисекундах. Определяет глобальное время задержки слайда перед сменой. Данное значение можно переопределить на уровне каждого отдельного Слайда.

source: Wait with starting the first animation after the slider has been loaded. 1000 will wait 1sec before the slider starts. Useful option for manipulate the DOM before the slider starts.
ru_ru: Задержка между моментом, когда слайдер был загружен в броузере и началом анимации Первого слайда.

source: Start Delay
ru_ru: Задержка Старта

source: Auto Play stop after the Slider has been looped x time, which is defined via this parameter. -1 will ignore the option. First Loop is 0.
ru_ru: Автопроигрывание будет остановлено после данного количества циклов. Если установить значение -1, то данная опция будет проигнорирована.

source: Loop
ru_ru: Цикл

source: Auto Play stop at Slide Nr. “x” which is defined via this parameter. - 1 will ignore this parameter. First Index of Slide is 0.
ru_ru: Остановить Автопроигрывание на Слайде №__, если установлено -1, то данная опция будет проигнорирована.

source: Stop Autoplay
ru_ru: Остановка

source: Image Upload
ru_ru: Загрузить Изображение

source: Layer Opasity
ru_ru: Прозрачность Слоя

source: Layer horizontal scale <br> The value between 0 and 100, 1 = 100% of layer horizontal size
ru_ru: Горизонтальное искажение размера слоя<br> Значение между 0 и 100, 1 = 100% горизонтального размера слоя

source: Layer vertical scale <br> The value between 0 and 100, 1 = 100% of layer horizontal size
ru_ru: Вертикальное искажение размера слоя<br> Значение между 0 и 100, 1 = 100% вертикального размера слоя

source: Horizontal skew<br> The value between -100 and 100<br> 0 - no skew
ru_ru: Наклон по Горизонтали<br> Значение между -100 и 100<br> 0 - без наклона

source: Vertical skew<br> The value between -100 and 100<br> 0 - no skew
ru_ru: Наклон по Вертикали<br> Значение между -100 и 100<br> 0 - без наклона

source: Font color
ru_ru: Цвет Шрифта

source: Font size in px
ru_ru: Размер шрифта в px(пикселях)

source: Line height in px
ru_ru: Высота линии в px(пикселях)

source: Font weight
ru_ru: Толщина Шрифта

source: Text decoration
ru_ru: Декорирование текста

source: Left
ru_ru: Слева

source: Center
ru_ru: Центр

source: Right
ru_ru: Справа

source: Font Family
ru_ru: Семейство Шрифтов

source: Font
ru_ru: Шрифт

source: <strong>Full</strong> - Load all image element in a sequence at the initialisation. This will boost up the loading of your page, and will preload all images to have a smooth and breakless run already in the first loop;<br> <strong>Smart</strong> - It will load the page as quick as possible, and load only the current and neighbour slide elements. If slide is called which not loaded yet, will be loaded on demand with minimal delays.<br> <strong>Single</strong> - It will load only the the start slide. Any other slides will be loaded on demand.
ru_ru: <strong>Выкл</strong> - Загружает все ресурсы слайдера(изображения/шрифты/html) сразу же после инициализации слайдера на странице, это позволят избавиться от задержек во время стартовой анимации первого слайда, но увеличивает в целом скорость загрузки страницы;<br> <strong>Умный</strong> - как только возможно быстро загружает страницу, подгружая в нее самые необходимые элементы слайдера необходимые для старта анимации <br> <strong>Частичный</strong> - выгружает на страницу, только элементы первого слайда, все остальные слайды будут подгружены при обращении к ним.

source: Full
ru_ru: Выкл

source: Smart
ru_ru: Умный

source: Single
ru_ru: Частичный

source: Progressbar
ru_ru: Индикатор

source: Progress
ru_ru: Прогресс

source: If unchecked the Progressbar will be shown. To hide the Progress Bar check this.
ru_ru: Если не отмечено, в верхней части слайдера будер отображаться временная шкала

source: Loader Spinner Type. If you want disable it, set this option to <strong>off</strong>'
ru_ru: Вид индикатора загрузки. Если хотите отключить его, установите значение <strong>выкл</strong>

source: Loader Spinner
ru_ru: Индикатор Загрузки

source: Style 1
ru_ru: Стиль 1

source: Style 2
ru_ru: Стиль 2

source: Style 3
ru_ru: Стиль 3

source: Style 4
ru_ru: Стиль 4

source: Style 5
ru_ru: Стиль 5

source: If checked, the slider starts to play after it visible area enter in viewport
ru_ru: Если отмечено, то Слайдер начнет проигрывание, только после того, как его видимая область попадет во Viewport(Область страницы, которая в данный момент находится в окне браузера).

source: <strong>Wait</strong> will only first time trigger the Slider. In case the Slider is not visible during / after the Document loaded, the slider will wait till the Slider becomes in Visible Position. Once the Slider is triggered to play, it will not stop again, even if the slider is not in the viewport.<br><strong>Pause</strong> similar to the wait behavior, however the slider will stop every time the Slider is out of the visible area.
ru_ru: <strong>Ожидание</strong> - проигрывание слайдера начнется, только после того, как его видимая часть попадет во Viewport. После этого слайдер начнет свое привычное автопроигрывание, в не зависимости от того, находится он в данный момент во Viewport или нет.<br><strong>Пауза</strong> тоже, что и Ожидание, за исключением того, что проигрывание слайдера будет останавливаться каждый раз, как только он будет покидать Viewport.

source: Out Off
ru_ru: Ожидание

source: Define how many percent of the Slider must be visible before it starts. 100% means, the full slider must be in the visible area before it starts, and 20% will start the slider already after 20% of the slider becomes visible.
ru_ru: Определяет в процентах, какая часть слайдера должна попасть во Viewport, чтобы началось воспроизведение. К примеру: 100% означает, что для начала воспроизведения, слайдер полностью попал во Viewport, а 20% означает, что воспроизведение начнется, как только 20% слайдера попадет во Viewport.

source: Visible Area
ru_ru: Видимая Область

source: Shadow type which will be drawn via jQuery and css on demand.
ru_ru: Тип тени, которая будет создана средствами jQuery и css

source: Style 6
ru_ru: Стиль 6

source: Finish Animation
ru_ru: Финальная Анимация

source: Layer Finish X axis position in px relatively to Slider Grid
ru_ru: Позиция слоя по оси X в конце финальной анимации

source: Layer Finish Y axis position in px relatively to Slider Grid
ru_ru: Позиция слоя по оси Y в конце финальной анимации

source: Animation Out Easing
ru_ru: Смягчение Финальной Анимации

source: Easing
ru_ru: Смягчение

source: Duration of the Out Animation
ru_ru: Длительность финальной анимации

source: Scale, Skew, Opacity
ru_ru: Искажение, Наклон, Прозрачность

source: Layer Opacity on finish position
ru_ru: Прозрачность слоя на финальной позиции

source: Layer horizontal scale on finish position<br> The value between 0 and 100, 1 = 100% of layer horizontal size
ru_ru: Горизонтальное искажение слоя на финальной позиции<br> Значение между 0 и 100, 1 = 100% горизонтального размера слоя

source: Layer vertical scale on finish position<br> The value between 0 and 100, 1 = 100% of layer horizontal size
ru_ru: Вертикальное искажение слоя на финальной позиции<br> Значение между 0 и 100, 1 = 100% вертикального размера слоя

source: Horizontal axis rotation degree on finish position<br> The value between -1200 and 1200
ru_ru: Градус поворота слоя по Горизонтали на финальной позиции<br> Значение между -1200 и 1200

source: Vertical axis rotation degree on finish position<br> The value between -1200 and 1200
ru_ru: Градус поворота слоя по Вертикали на финальной позиции<br> Значение между -1200 и 1200

source: Z axis rotation degree on start position<br> The value between -1200 and 1200
ru_ru: Градус поворота слоя по оси Z на финальной позиции<br> Значение между -1200 и 1200

source: Horizontal skew on finish position.<br> The value between -100 and 100<br> 0 - no skew
ru_ru: Горизонтальный Наклон слоя на финальной позиции.<br> Значение между -100 и 100<br> 0 - без поворота

source: Vertical skew on finish position.<br> The value between -100 and 100<br> 0 - no skew
ru_ru: Вертикальный Наклон слоя на финальной позиции.<br> Значение между -100 и 100<br> 0 - без поворота

source: Image
ru_ru: Изображение

source: Attributes
ru_ru: Атрибуты

source: Border
ru_ru: Граница

source: Transformation
ru_ru: Трансформация

source: Rotation
ru_ru: Вращение

source: Link
ru_ru: Ссылка

source: Link URL
ru_ru: URL адрес ссылки

source: <strong>_blank</strong> - Opens the linked document in a new window or tab;<br> <strong>_self</strong> - Opens the linked document in the same frame.
ru_ru: <strong>_blank</strong> - Ссылаемый документ будет открыт в новой вкладке или окне браузера;<br> <strong>_self</strong> - Ссылаемы документ будет открыт в текущем окне браузера.

source: Target
ru_ru: Цель

source: Type
ru_ru: Тип

source: Layer Widht in px
ru_ru: Ширина слоя в px(пикселях)

source: Layer Height in px
ru_ru: Высота слоя в px(пикселях)

source: If checked, the Ken Burns Effect will be enabled.
ru_ru: Если отмечено, активирует для фона Ken Burns эффект

source: On/Off
ru_ru: Вкл/Выкл

source: The duration length of the Ken Burns Effect. It should be same or longer then the length of Slide Duration defined per slide or default in slider settings.
ru_ru: Продолжительность эффекта Ken Burns. Она может быть длиннее, чем продолжительность самого слайда.

source: The Ease effect of the Ken Burns Effect.
ru_ru: Смягчение анимации для эффекта Ken Burns

source: The start Zoom Value. If the image would not cover the container any more, it will be automatically corrected to the next possible value.<br><strong>Default:</strong> - 100 (no scale)
ru_ru: Определяет увеличение фона на старте эффекта <strong>По умолчанию:</strong> - 100 (без увеличения)

source: Start Zoom
ru_ru: Зум на старте

source: The End Zoom Value of the Ken Burns Effect. If the image would not cover the container any more, it will be automatically corrected to the next possible value.<br><strong>Example:</strong> - 110 (background will be zoomed for 10%)
ru_ru: Определяет увеличение фона в финале эффекта <strong>Например:</strong> - 110 (означает, что фон будет увеличен на 10% от его размера на старте эффекта)

source: Finish Zoom
ru_ru: Зум на финише

source: Horizontal offsets for the Start position. It will be related to the Zoom and background position settings, and from that position it will move the full slide offsetting on X axis
ru_ru: Горизонтальный сдвиг фона в начале эффекта. <strong>Например:</strong> - 50 (означает, что фон будет сдвинут влево на 50 пикселей по оси X)

source: X Start
ru_ru: X на старте

source: Vertical offsets for the Start position. It will be related to the Zoom and background position settings, and from that position it will move the full slide offsetting on Y axis
ru_ru: Вертикальный сдвиг фона в начале эффекта. <strong>Например:</strong> - 50 (означает, что фон будет сдвинут вниз на 50 пикселей по оси Y)

source: Y Start
ru_ru: Y на старте

source: Horizontal offsets for the End position.
ru_ru: Горизонтальный сдвиг фона в конце эффекта.

source: X Finish
ru_ru: X в конце

source: Vertical offsets for the End position.
ru_ru: Вертикальный сдвиг фона в конце эффекта.

source: Y Finish
ru_ru: Y в конце
