Repository: kosmosby/shop
Catalog: *-apps/shop/plugins/xml/locale/*/LC_MESSAGES/shop_xml.po
Languages: ru_ru

source: Save
ru_ru: Сохранить

source: Saved
ru_ru: Сохранено

source: Import as
ru_ru: Загружать как

source: Error
ru_ru: Ошибка

source: Delete profile
ru_ru: Удалить профиль

source: An error occurred. Reload the page.
ru_ru: Произошла ошибка. Перезагрузите страницу

source: Matches not specified
ru_ru: Соответствия не установлены

source: Matchings manager
ru_ru: Менеджер соответствий

source: Update scheme
ru_ru: Обновить схему

source: Cancel
ru_ru: Отмена

source: No feature selected
ru_ru: Необходимо выбрать характеристику

source: Delete item type
ru_ru: Удалить тип эллемента

source: Bad request
ru_ru: Запрос не удался

source: Cannot save
ru_ru: Ошибка при сохранении

source: Select at least one option
ru_ru: Необходимо вырать хотябы однин параметр

source: Delete saved session
ru_ru: Удалить сохранённую сессию

source: An error occurred
ru_ru: Произошла ошибка

source: File not uploaded
ru_ru: Файл не загружен

source: File manager
ru_ru: Файловый менеджер

source: Update
ru_ru: Обновить

source: Close
ru_ru: Закрыть

source: Need to select the file
ru_ru: Необходимо выбрать файл

source: Error while saving
ru_ru: Ошибка при сохранении

source: Delete file
ru_ru: Удалить файл

source: Delete failed
ru_ru: Удаление не уалось

source: Server error
ru_ru: Серверная ошибка

source: Profile 1
ru_ru: Профиль 1

source: Profile
ru_ru: Профиль

source: File
ru_ru: Файл

source: Link
ru_ru: Ссылка

source: From computer
ru_ru: С компьютера

source: From server
ru_ru: С сервера

source: Delete
ru_ru: Удалить

source: Select
ru_ru: Выбрать

source: Change
ru_ru: Сменить

source: Set matchings
ru_ru: Установить соответствия

source: Change matchings
ru_ru: Сменить соответсвия

source: Product type
ru_ru: Тип товаров

source: Bind to profile
ru_ru: Привязать к профилю

source: No
ru_ru: Нет

source: Yes
ru_ru: Да

source: Enable if you have several files in which there may be products with the same external identifier.
ru_ru: Включите если у вас будут синхронизироватся несколько файлов в которых могут быть товары с одинаковым внешним идентификатором

source: Import categories
ru_ru: Импортировать категории

source: Belonging to categories
ru_ru: Связь товаров с категориями

source: Delete from old, add to new
ru_ru: Удалять из старых, добавлять в новые

source: Leave old, add to new ones
ru_ru: Оставлять старые, добавлять в новые

source: Set only for new products
ru_ru: Устанавливать только для новых товаров

source: Do not set
ru_ru: Не устанавливать

source: Upload category structure to a separate category
ru_ru: Загрузить структуру категорий в отдельную категорию

source: Choose parent category
ru_ru: Выберите родительскую категорию

source: Add new products to category
ru_ru: Добавлять новые товары в категорию

source: Do not add
ru_ru: Не добавлять

source: Images
ru_ru: Изображения

source: Delete old, add new
ru_ru: Удалять старые, добавлять новые

source: Add only new
ru_ru: Добавлять только новые

source: Add only for new products
ru_ru: Только для новых товаров

source: Markup
ru_ru: Наценка

source: No markup
ru_ru: Нет

source: Fixed
ru_ru: Фиксированная

source: Stepped
ru_ru: Ступенчатая

source: Sum
ru_ru: Сумма

source: Percent
ru_ru: Процент

source: Price
ru_ru: Цена

source: Type
ru_ru: Тип

source: till
ru_ru: до

source: Rules not found
ru_ru: Правила не установлены

source: In other cases
ru_ru: В иных случаях

source: Round prices
ru_ru: Округлять цены

source: Do not round
ru_ru: Не округлять

source: Weight unit
ru_ru: Ед. измерения веса

source: g
ru_ru: г

source: kg
ru_ru: кг

source: Mark items
ru_ru: Отмечать товары

source: Do not mark
ru_ru: Не отмечать

source: Search rules
ru_ru: Правила поиска

source: Search by name
ru_ru: Искать товары по наименованию

source: Search by sku
ru_ru: Искать товары по артикулу

source: Other settings
ru_ru: Другие настройки

source: Do not add new products
ru_ru: Не добавлять новые товары

source: Skip new products updating only those that were created earlier
ru_ru: Пропускать новые товары обновляя только те которые были созданы ранее

source: Do not update products
ru_ru: Не обновлять товары

source: Skip the goods that were created earlier by adding only new items
ru_ru: Пропускать товары которые были созданы ранее добавляя только новинки

source: Do not add new categories
ru_ru: Не добавлять новые категории

source: Skip new categories updating only those that were created earlier
ru_ru: Пропускать новые категории обновляя только те которые были созданы ранее

source: Do not update categories
ru_ru: Не обновлять категории

source: Skip categories that were created earlier by adding only new items
ru_ru: Пропускать категории которые были созданы ранее, добавляя новые

source: Reset count of missing items
ru_ru: Обнулять исчезнувшие товары

source: Products that disappear from the file will be removed from sale
ru_ru: Товары которые исчезнут из файла будут сняты с продажи

source: Force the use of the protocol in image references
ru_ru: Принуждать использование протокола в ссылках на изображения

source: This option allows you to replace the protocol for accessing images (for example, from http to https) <br> when it is specified incorrectly and the redirect does not work due to the included options <i> safe_mode / open_basedir </ i>
ru_ru: Данная опция позволяет заменять протокол доступа к изображениям (например с http на https) в тех случаях когда он указан неверно а редирект не работает из за вклчённых опциях safe_mode/open_basedir

source: Select protocol
ru_ru: Выберите нужный протокол

source: Limit thread length
ru_ru: Ограничить длину потока

source: Automatic restart of the import process to prevent exceeding the limit for the execution time of the script.
ru_ru: Настройте автоматический перезапуск процесса импорта чтобы предотвратить превышение лимита на время выполнения скрипта.

source: Restore unfinished sessions
ru_ru: Восстанавливать незавершенные сессии

source: Unfinished import session detected
ru_ru: Обнаружена незавершённая сессия импорта

source: Delete session
ru_ru: Удалить сессию

source: Start time
ru_ru: Время начала

source: Interruption time
ru_ru: Время прерывания

source: The next import will start from the place where the previous import was interrupted
ru_ru: Следующий импорт начнётся с того места где остановился предыдущий

source: To make the import work by default - delete this session using the button above
ru_ru: Чтобы импорт сработал по умолчанию - удалите сессию кнопкой выше

source: Delayed execution
ru_ru: Отложенное выполнение

source: CRON job not configured
ru_ru: Задание CRON не настроено

source: A deferred update has never been executed.
ru_ru: Отложенное обновление еще ни разу не выполнялось

source: The CRON job has not been performed for a long time
ru_ru: Отложенное обновление давно не выполнялось

source: CRON job configured
ru_ru: Задание CRON настроено

source: The last deferred synchronization was performed
ru_ru: Последняя отложенная сихронизация выполнялась

source: Start sync
ru_ru: Начать синхронизацию

source: Please do not close the browser until the operation is finished.
ru_ru: Пожалуйста, не закрывайте браузер пока операция не закончится

source: File structure
ru_ru: Структура файла

source: Add
ru_ru: Добавить

source: Select feature
ru_ru: Выберите характеристику

source: Select product type
ru_ru: Выберите тип товаров

source: All product types
ru_ru: Все типы товаров

source: Create sku
ru_ru: Создавать артикул

source: Resubmit
ru_ru: Обновлять повторно

source: Choose feature
ru_ru: Выберите характеристику

source: Error while rebuild thumbnails
ru_ru: Ошибка при генерации миниатюр

source: PHP extension XMLReader required
ru_ru: Расширение PHP XMLReader не найдено

source: PHP extension SimpleXML required
ru_ru: Расширение PHP SimpleXML не найдено

source: Profile configuration not found
ru_ru: Конфигурация профиля не найдена

source: Source type not specified
ru_ru: Не указан тип источника

source: No matches specified
ru_ru: Соответсвия не установлены

source: Nothing to import
ru_ru: Нечего импортировать

source: No file selected
ru_ru: Файл не выбран

source: Link to the xml file not specified
ru_ru: Не указана ссылка на XML файл

source: Not found any data to import
ru_ru: Данные для импорта не найдены

source: Cannot open the file
ru_ru: Невозможно открыть файл

source: Synchronization completed successfully
ru_ru: Синхронизация завершена успешно

source: Categories
ru_ru: Категории

source: Total processed
ru_ru: Всего обработано

source: Added
ru_ru: Добавлено

source: Updated
ru_ru: Обновлено

source: Products
ru_ru: Товары

source: External ID not found
ru_ru: Не найден внешний ID

source: Import from XML
ru_ru: Импорт товаров из XML

source: Execution time
ru_ru: Время выполнения

source: Memory consumption
ru_ru: Потребление памяти

source: Processed products
ru_ru: Товаров обработано

source: Processed categories
ru_ru: Категорий обработано

source: Undefined primary key
ru_ru: Неизвестный первичный ключ

source: Category
ru_ru: Категория

source: Product
ru_ru: Товар

source: Name
ru_ru: Наименование

source: External ID
ru_ru: Внешний ID

source: Parent external ID
ru_ru: Внешний ID родителя

source: Description
ru_ru: Описание

source: Product name
ru_ru: Наименование

source: Currency
ru_ru: Валюта

source: Summary
ru_ru: Краткое описание

source: Status
ru_ru: Статус

source: Title
ru_ru: Заголовок

source: META Keyword
ru_ru: META Ключевые слова

source: META Description
ru_ru: META Описание

source: Storefront link
ru_ru: Ссылка на витрину

source: Product images
ru_ru: Изображения

source: Video URL on YouTube or Vimeo
ru_ru: URL виде на YouTube или Vimeo

source: Category ID
ru_ru: ID категории

source: Group ID
ru_ru: ID группы

source: SKU name
ru_ru: Название артикула

source: SKU code
ru_ru: Код артикула

source: Available for purchase
ru_ru: Доступно для заказа

source: Compare at price
ru_ru: Зачёркнутая цена

source: Purchase price
ru_ru: Цена закупки

source: In stock
ru_ru: Количество в наличии

source: Upload to existing
ru_ru: Загрузить в существующую

source: 1C identifier
ru_ru: Идентификатор 1С

source: Import products from XML
ru_ru: Импорт товаров из XML

source: Exchange data with external servers
ru_ru: Обмен данными с внешними серверами

source: XML parser
ru_ru: Синтаксический анализатор XML

source: Toolset to convert XML to an object
ru_ru: Набор инструментов для преобразования XML в объект

source: Main
ru_ru: Основные

source: Product fields
ru_ru: Поля товара

source: Category fields
ru_ru: Поля категории

source: Product features
ru_ru: Характеристики товара

source: XML profiles
ru_ru: Профили XML

source: Image URL separator
ru_ru: Разделитель ссылок на изображения

source: Comma
ru_ru: Запятая

source: Semicolon
ru_ru: Точка с запятой

source: Space
ru_ru: Пробел

source: By default, plugin takes every tag/attribute value as a separate and direct link to the image. But sometimes links are concatenated and separted by comma or another char
ru_ru: По умолчанию, плагин воспринимает каждое значение тега/артибута как отдельную прямую ссылку на изображение. Но иногда ссылки указаны в одном теге разделённые к примеру запятой

source: Category level
ru_ru: Категория уровень

source: Recommended price
ru_ru: Рекомендуемая цена (РРЦ)

source: Reset stocks that are not updated by the plugin
ru_ru: Обнулять склады не обновлённые плагином

source: If you load leftovers into a specific warehouse, then the other warehouses will be reset to zero. To prevent other stores from changing the value, disable this option.
ru_ru: Если вы загружаете остатки в определённый склад, то друие склады будут обнулены. Чтобы другие склады не меняли значение отключите эту опцию.

source: Convert prices to the main store currency
ru_ru: Конвертировать цены в основную валюту магазина

source: Template
ru_ru: Шаблон

source: Characteristic fields
ru_ru: Поля характеристик

source: Feature unit
ru_ru: Ед. измерения

source: Feature value
ru_ru: Значение характеристики

source: Feature name
ru_ru: Название характеристики

source: Unit
ru_ru: Ед. измерения

source: Add profile
ru_ru: Добавить профиль

source: Purchase option
ru_ru: Вариант покупки

source: Vertical bar
ru_ru: Вертикальная черта

source: Products name
ru_ru: Названия товаров

source: Feature code
ru_ru: Код характеристики
