Repository: kosmosby/shop
Catalog: *-data/protected/*-installer/backup/*-plugins/shipping/courier/locale/*/LC_MESSAGES/shipping_courier.po
Languages: ru_ru

source: Courier
ru_ru: Курьер

source: Shipping is restricted to the specific country and region only. Shipping rate is calculated based on either total amount or weight of the shipment.
ru_ru: Доставка ограничивается только определенной страной и регионом. Стоимость доставки рассчитывается на основании итоговой стоимости заказа либо веса отправления.

source: Delivery time
ru_ru: Время доставки

source: Same day
ru_ru: В течение дня

source: Next day
ru_ru: Следующий день

source: 2-3 days
ru_ru: 2–3 дня

source: 1-2 days
ru_ru: 1–2 дня

source: 1 week
ru_ru: 1 неделя

source: Undefined
ru_ru: Не определено

source: Packing list
ru_ru: Лист доставки

source: Order summary for courier shipping
ru_ru: Информация о заказе для курьера

source: Print
ru_ru: Печать

source: Paid
ru_ru: Оплачен

source: Payment
ru_ru: Оплата

source: Shipping cost
ru_ru: Стоимость доставки

source: Comment
ru_ru: Комментарий

source: Shipping address
ru_ru: Адрес доставки

source: Shipping will be restricted to the selected country. Rates defined below will be applied to the entire country.
ru_ru: Доставка будет ограничена только выбранной страной. Указанные ниже расценки распространяются на всю страну.

source: Shipping region
ru_ru: Регион доставки

source: Shipping will be restricted to the selected region.
ru_ru: Доставка будет ограничена только выбранным регионом.

source: Locality name
ru_ru: Название населенного пункта

source: If courier shipping is provided only within specific localities, enter the locality names separated by comma so that customer is not be prompted to enter a locality name when this shipping option is selected; a locality name will be automatically fetched as you specify it here. If this field is left blank, a customer will be prompted to enter a locality name.
ru_ru: Если доставка курьером доступна только в определенных населенных пунктах, введите их названия через запятую. Покупателю не придется указывать название населенного пункта при выборе этого способа доставки — оно автоматически будет получено из этой настройки. Если оставить это поле пустым, покупателю будет предложено ввести название населенного пункта.

source: Shipping rate calculation
ru_ru: Расчет стоимости доставки

source: By weight
ru_ru: По весу

source: By price
ru_ru: По цене

source: Order weight, KG
ru_ru: Вес заказа, кг

source: Shipping rate, USD
ru_ru: Стоимость заказа в долларах США

source: Order total
ru_ru: Сумма заказа

source: Shipping rate
ru_ru: Стоимость доставки

source: Shipment weight
ru_ru: Вес отправления

source: Shipment amount
ru_ru: Сумма отправления

source: Add rate
ru_ru: Добавить тариф

source: kg
ru_ru: кг

source: lbs
ru_ru: фунт

source: Weight dimension unit
ru_ru: Единица измерения веса

source: Enter shipping rate as a flat rate, as a percent of cart total, or as a sum of both. Example: <b>20+10%%</b> will calculate shipping rate as 20 %s + 10%% of cart total.
ru_ru: Введите стоимость доставки в виде числа, процента от общей стоимости корзины покупок или в виде суммы этих слагаемых. Пример: <b>20+10%%</b> рассчитает стоимость доставки как 20 %s + 10%% от общей стоимости корзины покупок.

source: Preferred delivery time
ru_ru: Желаемое время доставки

source: Preferred delivery time &amp; working schedule
ru_ru: Желаемое время доставки и график работы

source: Online map settings are available in <a href="%s">Installer</a> app.
ru_ru: Настройки онлайн-карт доступы в «<a href="%s">Инсталлере</a>».

source: Default address fields
ru_ru: Стандартные поля адреса

source: Enable shipping address fields which must always be filled by a client during checkout.
ru_ru: Отметьте поля адреса доставки, заполнение которых должно требоваться при выборе доставки курьером во время оформлении заказа.

source: Should some of the enabled fields be filled on the contact info step, then they will not be displayed on courier shipping selection.
ru_ru: Если эти поля будут заполнены на шаге ввода контактной информации, то при выборе способа доставки курьером они отображаться не будут.

source: If a fixed value is set for a field in app settings, then enabling such a field here will be ignored and the field will not be displayed on courier shipping selection during checkout.
ru_ru: Если для какого-либо поля адреса в настройках приложения установлено фиксированное значение, то выбор этого поля здесь будет игнорироваться и поле не будет отображаться при выборе доставки курьером.

source: Fields that you enable here will be required for completion regardless of any other client address prompt settings.
ru_ru: Отмеченные здесь поля будут обязательными для заполнения вне зависимости от других настроек запроса адреса клиента.

source: Disabled can be only fields that are not completed in the above setting “Shipping region”.
ru_ru: Снять отметки можно только с тех полей адреса, которые не заполнены выше в настройке «Регион доставки».

source: Address fields management
ru_ru: Управление полями адреса

source: Use plugin‘s default fields only
ru_ru: Использовать только стандартные поля адреса из настроек плагина

source: Enable this option for the plugin to require from a client <em>mandatory</em> completion of the fields only, which are selected below in setting “Default address fields”.<br>Disable it to make the plugin <em>optionally</em> request only address fields defined by app settings (the app must request all address fields required for selected shipping method).
ru_ru: Включите, если плагин должен требовать <em>обязательное</em> заполнение только полей, выбранных ниже в настройке «Стандартные поля адреса».<br>Выключите, если плагин должен запрашивать <em>необязательное</em> заполнение полей адреса из настроек приложения (приложение должно запрашивать все поля адреса, обязательные для выбранного способа доставки).

source: Specified time in hours
ru_ru: Указанное количество часов

source: Average delivery time in hours
ru_ru: Среднее количество часов доставки

source: Average time in hours required for a courier to deliver an order. It will be added to the order ready time with the account of values in “Delivery intervals” table with extra days off and workdays.
ru_ru: Среднее время в часах, которое требуется курьеру для доставки заказа. Оно прибавляется к общему времени готовности заказа с учетом значений в таблице «Интервалы доставки» с дополнительными выходными и рабочими днями.

source: Extra days off
ru_ru: Дополнительные выходные

source: Extra workdays
ru_ru: Дополнительные рабочие дни

source: Select dates of extra days off and enable at least one checkbox in “Extra days off” column of the “Delivery intervals” table. Delivery intervals are valid for all extra days off.
ru_ru: Выберите даты дополнительных выходных дней и в таблице «Интервалы доставки» минимум для одного интервала включите флажок в столбце «Доп. выходной». Интервалы действуют на все дополнительные выходные дни.

source: Select dates of extra workdays and enable at least one checkbox in “Extra workdays” column of the “Delivery intervals” table. Delivery intervals are valid for all extra workdays.
ru_ru: Выберите даты дополнительных рабочих дней и в таблице «Интервалы доставки» минимум для одного интервала включите флажок в столбце «Доп. рабочий день». Интервалы действуют на все дополнительные рабочие дни.

source: Additional address fields
ru_ru: Дополнительные поля адреса

source: Entrance
ru_ru: Подъезд

source: Intercom number
ru_ru: Номер домофона

source: Floor
ru_ru: Этаж

source: Add extra subfields of “<em>Text (input)</em>” type for the “Address” field via <a href="%s">Settings</a> app to enable these additional address fields.
ru_ru: Добавьте собственные поля типа «<em>Текст (input)</em>» для поля «Адрес» в приложении «<a href="%s">Настройки</a>», чтобы включить эти дополнительные поля адреса.

source: Enable extra address fields which you want to be offered for completion to customers during checkout.
ru_ru: Включите дополнительные поля адреса, чтобы они предлагались для заполнения клиентам во время оформления заказа.

source: You have disabled address field, selected for additional field %s, in system settings. Please either enable again the selected address field or select another field.
ru_ru: Вы отключили в системных настройках поле адреса, выбранное для дополнительного поля «%s». Либо снова включите это поле адреса, либо выберите другое поле.

source: Please select different address fields for additional fields %s.
ru_ru: Выберите разные поля адреса для каждого из дополнительных полей %s.

source: Please select different address fields for each additional field.
ru_ru: Выберите разные поля адреса для каждого из дополнительных полей.
