Repository: kosmosby/shop
Catalog: *-data/protected/*-installer/backup/*-plugins/shipping/boxberry/locale/*/LC_MESSAGES/shipping_boxberry.po
Languages: ru_ru

source: Real-time shipping quotes with <a href="https://boxberry.ru/en/">Boxberry</a> service.
ru_ru: Расчет стоимости доставки сервисом <a href="https://boxberry.ru/">Boxberry</a>.

source: Shipping cost
ru_ru: Стоимость доставки

source: Minimum order cost for free delivery
ru_ru: Минимальная стоимость заказа для бесплатной доставки

source: Shipping rates provided by Boxberry service are ignored when free shipping is applied.
ru_ru: Стоимость доставки, рассчитанная сервисом Boxberry, игнорируется, когда применяется бесплатная доставка.

source: Declared value for prepaid delivery (insurance cost)
ru_ru: Объявленная стоимость для отправлений с предоплатой (страховая стоимость)

source: Set up markup costs in your Boxberry account.
ru_ru: Настройте стоимость наценок в своем личном кабинете Boxberry.

source: Shipping options
ru_ru: Варианты доставки

source: Select values corresponding to your contract’s conditions.
ru_ru: Выберите значения в соответствии с условиями своего договора.

source: If “With prepayment only” option is selected, then in Shop-Script, with “In-cart checkout” mode enabled, only prepayment options are available after shipping option selection.
ru_ru: Если выбран вариант «Только предоплата», то в приложении Shop-Script в режиме «Оформление заказа в корзине» после выбора варианта доставки будут доступны только варианты предоплаты.

source: If “All” option is selected, then in Shop-Script, with “In-cart checkout” mode enabled, minimum shipping cost for prepayment is displayed by default. Once a shipping and a payment option are selected, the displayed shipping cost is updated accordingly.
ru_ru: Если выбран вариант «Все», то в приложении Shop-Script в режиме «Оформление заказа в корзине» по умолчанию будет показана минимальная стоимость доставки с расчетом на предоплату, а после выбора вариантов доставки и оплаты стоимость доставки будет уточнена.

source: Pickup points
ru_ru: Пункты выдачи заказов

source: Courier delivery
ru_ru: Курьерская доставка

source: Courier name
ru_ru: Название курьера

source: Russian Federation
ru_ru: Российская Федерация

source: Availability settings
ru_ru: Условия доступности

source: Country
ru_ru: Страна

source: Region
ru_ru: Регион

source: Shipping will be restricted to the selected region.
ru_ru: Доставка будет ограничена выбранным регионом.

source: Localities
ru_ru: Населенные пункты

source: Separate locality names with a comma.
ru_ru: Разделяйте названия населенных пунктов запятой.

source: Max weight
ru_ru: Максимальный вес

source: g
ru_ru: г

source: Max length
ru_ru: Максимальная длина

source: Max width
ru_ru: Максимальная ширина

source: Max height
ru_ru: Максимальная высота

source: Max dimensions
ru_ru: Максимальные размеры

source: Basic settings
ru_ru: Основные настройки

source: Service name
ru_ru: Название службы

source: API URL
ru_ru: Адрес API

source: Token
ru_ru: Токен

source: Parcel office city
ru_ru: Город приема посылок

source: Start typing a city name
ru_ru: Начните искать город

source: To select a parcel office, please enter a token and save the settings.
ru_ru: Чтобы выбрать пункт приема посылок, введите токен и сохраните настройки.

source: There are no parcel offices in your city.
ru_ru: В вашем городе нет пункта приема посылок.

source: Parcel office
ru_ru: Пункт приема посылок

source: Default weight
ru_ru: Вес по умолчанию

source: Default length
ru_ru: Длина по умолчанию

source: m
ru_ru: м

source: Default width
ru_ru: Ширина по умолчанию

source: Default height
ru_ru: Высота по умолчанию

source: Used only if order dimensions have not been calculated by a special plugin. If no value is specified, shipping rate and terms will not be calulated.
ru_ru: Используется, только если габариты заказа не были рассчитаны специальным плагином. Если значение не указано, то сроки и стоимость доставки в пункт выдачи заказов не рассчитываются.

source: Integration settings
ru_ru: Настройки интеграции

source: Upon checkout, a dellivery draft is created in your Boxberry account. Should you edit an order in your Webasyst backend, the corresponding draft is updated automatically.
ru_ru: После оформления заказа в вашем личном кабинете Boxberry создается посылка (черновик отгрузки). В случае редактирования заказа в бекенде Webasyst этот черновик автоматически обновляется.

source: Type of parcel delivery
ru_ru: Вид выдачи посылок

source: If nothing is selected, a default value from the store profile’s “Services” section of your Boxberry account is used.
ru_ru: Если ничего не выбрано, то используется значение по умолчанию, установленное в разделе «Услуги» профиля магазина в вашем личном кабинете Boxberry.

source: Store name for SMS and email notifications
ru_ru: Наименование магазина для SMS- и email-оповещений

source: Notifications are sent by Boxberry service.
ru_ru: Оповещения отправляются сервисом Boxberry.

source: Delivery is not available. Please check the shipping address and the selected payment type.
ru_ru: Доставка недоступна. Проверьте адрес доставки и выбранный вариант оплаты.

source: Do not use
ru_ru: Не использовать

source: All
ru_ru: Все

source: With prepayment only
ru_ru: Только с предоплатой

source: Delivery without parcel opening
ru_ru: Выдача без вскрытия

source: Delivery with parcel opening and completeness check
ru_ru: Выдача со вскрытием и проверкой комплектности

source: Delivery of a parcel part
ru_ru: Выдача части вложения

source: from
ru_ru: oт

source: Delivery is not available for specified ZIP code.
ru_ru: Доставка для указаного индекса недоступна.

source: Courier
ru_ru: Курьер

source: The sum of length, width, and height values must not exceed 2.5 m.
ru_ru: Сумма значений длины, ширины и высоты не должна превышать 2,5 м.

source: Specify either a fixed value expressed in a currency or percentage of the order total, or their sum or difference.
ru_ru: Укажите фиксированную стоимость в валюте или долю от суммы заказа в процентах, либо их сумму или разность.

source: Examples:
ru_ru: Примеры:

source: Declared value must not exceed 300,000 rubles.
ru_ru: Объявленная стоимость не может превышать 300 000 рублей.

source: To switch to the test mode, request a test API address and token from Boxberry support team.
ru_ru: Чтобы переключиться в тестовый режим, запросите тестовый адрес API и токен у службы поддержки Boxberry.

source: Error during automatic shipment creation. Please create a shipment manually in your personal account on Boxberry website. See detailed error-related information in log file <em>wa-log/wa-plugins/shipping/boxberry/api_requests.log</em>.
ru_ru: Ошибка при автоматическом создании отправления. Создайте отправление вручную в личном кабинете на сайте Boxberry. Подробную информацию об ошибке смотрите в лог-файле <em>wa-log/wa-plugins/shipping/boxberry/api_requests.log</em>.

source: In case of payment on delivery, the declared value passed to the shipping service is equal to the order total less the shipping cost, i.e. pure cost of delivered items with discount applied.
ru_ru: В случае оплаты заказа при получении в службу доставки передается объявленная стоимость отправления, равная стоимости заказа за вычетом стоимости доставки, т. е. стоимость товаров с учетом скидки.
